{
  "Aberrant Dragonmark [EB]_minify": {
    "descriptionModels": [
      {
        "description": "You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n\n- You learn a cantrip of your choice from the sorcerer spell list. In addition, choose a 1st-level spell from the sorcerer spell list. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.\n\n- When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage.\nYou also develop a random flaw from the Aberrant Dragonmark Flaws table.\n\nAberrant Dragonmark Flaws\nd8 --> Flaw\n1 --> Your mark is a source of constant physical pain.\n2 --> Your mark whispers to you. Its meaning can be unclear.\n3 --> When you're stressed, the mark hisses audibly.\n4 --> The skin around the mark is burned, scaly, or withered.\n5 --> Animals are uneasy around you.\n6 --> You have a mood swing any time you use your mark.\n7 --> Your looks change slightly whenever you use the mark.\n8 --> You have horrific nightmares after you use your mark.",
        "level": 1
      },
      {
        "description": "You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n\n- You learn a cantrip of your choice from the sorcerer spell list. In addition, choose a 1st-level spell from the sorcerer spell list. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.\n\n- When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage.\nYou also develop a random flaw from the Aberrant Dragonmark Flaws table.\n\nAberrant Dragonmark Flaws\nd8 --> Flaw\n1 --> Your mark is a source of constant physical pain.\n2 --> Your mark whispers to you. Its meaning can be unclear.\n3 --> When you're stressed, the mark hisses audibly.\n4 --> The skin around the mark is burned, scaly, or withered.\n5 --> Animals are uneasy around you.\n6 --> You have a mood swing any time you use your mark.\n7 --> Your looks change slightly whenever you use the mark.\n8 --> You have horrific nightmares after you use your mark.\n\n\nOptional: Greater Aberrant Powers\n\nAt the GM's option, a character who has the Aberrant Dragonmark feat has a chance of manifesting greater power. Upon reaching 10th level, such a character has a 10 percent chance of gaining an epic boon. If the character fails to gain a boon, they have a 10 percent chance the next time they gain a level.\n\nIf the character gains a boon, the GM chooses it or determines it randomly. The character also permanently loses one of their Hit Dice, and their hit point maximum is reduced by an amount equal to a roll of that die plus their Constitution modifier (minimum reduction of 1). This reduction can't be reversed by any means",
        "level": 10
      }
    ],
    "id": "Custom5af225fd-421c-4566-9da5-8a882b3587c8",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Aberrant Dragonmark [EB]",
    "notes": "",
    "type": "Feat"
  },
  "Aberrant Dragonmark_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: No existing dragonmark.\n\nYou have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n\n- You learn a cantrip from the sorcerer spell list. In addition, choose a 1st-level spell from the sorcerer spell list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again. Constitution is your spellcasting ability for these spells.\n\n- You can increase the power of your aberrant spells at the risk of your own vitality. When you cast a spell with your aberrant mark, you can use one of your Hit Dice to increase the spell’s level by 1. Immediately after you cast the spell, roll the Hit Die. You take damage equal to the number rolled",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Aberrant Dragonmark",
    "notes": "",
    "type": "Feat"
  },
  "Acrobat_minify": {
    "descriptionModels": [
      {
        "description": "You become more nimble, gaining the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n- You gain proficiency in the Acrobatics skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- As a bonus action, you can make a DC 15 Acrobatics check. If you succeed, difficult terrain doesn't cost you extra movement until the end of the current turn",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Acrobat",
    "notes": "",
    "type": "Feat"
  },
  "Actor_minify": {
    "descriptionModels": [
      {
        "description": "Skilled at mimicry and dramatics, you gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n\n- You have an advantage on Deception and Performance checks when trying to pass yourself off as a different person.\n- You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Insight check contested by your Deception check allows a listener to determine that the effect is faked",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Actor",
    "notes": "",
    "type": "Feat"
  },
  "Adept_of_the_Black_Robes_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, initiate of high sorcery (nuitari) feat\n\nYou chose the moon Nuitari to influence your magic, and your ambition and loyalty to the Order of the Black Robes have been recognized, granting you these benefits:\n\n- Ambitious Magic: You learn one 2nd-level spell of your choice. The 2nd-level spell must be from the enchantment or necromancy school of magic. You can cast this feat's 2nd-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast this spell using spell slots you have of the appropriate level. The spell's spellcasting ability is the one chosen when you gained the Initiate of High Sorcery feat.\n\n- Life Channel: You can channel your life force into the power of your magic. When a creature you can see within 60 feet of you fails a saving throw against a spell that deals damage that you cast, you can expend a number of Hit Dice equal to the level of the spell. Roll the expended Hit Dice and add them together. The damage that the creature takes increases by an amount equal to that total",
        "level": 4
      }
    ],
    "id": "Custom8f818c24-8577-4837-b515-ebe81057b773",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Adept of the Black Robes [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Adept_of_the_Red_Robes_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, initiate of high sorcery (lunitari) feat\n\nYou chose the moon Lunitari to influence your magic, and your dedication to maintaining the balance between all things has been recognized by the Order of the Red Robes, granting you these benefits:\n\n- Insightful Magic: You learn one 2nd-level spell of your choice. The 2nd-level spell must be from the illusion or transmutation school of magic. You can cast this feat's 2nd-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast this spell using spell slots you have of the appropriate level. The spell's spellcasting ability is the one chosen when you gained the Initiate of High Sorcery feat.\n\n- Magical Balance: When you make an attack roll or an ability check and roll a 9 or lower on the d20, you can balance fate and treat the roll as a 10. You can balance fate in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Customf337d32f-a62f-47f8-b273-751dcab52ce1",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Adept of the Red Robes [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Adept_of_the_White_Robes_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, initiate of high sorcery (solinari) feat\n\nYou chose the moon Solinari to influence your magic, and your oath to use magic to make the world a better place has been recognized by the Order of the White Robes, granting you these benefits:\n\n- Protective Magic: You learn one 2nd-level spell of your choice. The 2nd-level spell must be from the abjuration or divination school of magic. You can cast this feat's 2nd-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast this spell using spell slots you have of the appropriate level. The spell's spellcasting ability is the one chosen when you gained the Initiate of High Sorcery feat.\n\n- Protective Ward: When you or a creature you can see within 30 feet of you takes damage, you can use your reaction to expend a spell slot and weave protective magic around the target. Roll a number of d6s equal to the level of the spell slot expended and reduce the damage the target takes by the total rolled on those dice + your spellcasting ability modifier",
        "level": 4
      }
    ],
    "id": "Customa332ac95-4b0b-4450-94a7-27cc0994f1ae",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Adept of the White Robes [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Alchemist_minify": {
    "descriptionModels": [
      {
        "description": "You have studied the secrets of alchemy and are an expert in its practice, gaining the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n\n- You gain proficiency with alchemist's supplies. If you are already proficient with them, you double your proficiency bonus to checks you make with them.\n\n- As an action, you can identify one potion within 5 feet of you, as if you had tasted it. You must see the liquid for this benefit to work.\n\n- Over the course of any short rest, you can temporarily improve the potency of one potion of healing of any rarity. To use this benefit, you must have alchemist's supplies with you, and the potion must be within reach. If the potion is drunk no more than 1 hour after the short rest ends, the creature drinking the potion can forgo the potion's die roll and regains the maximum number of hit points that the potion can restore",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Alchemist",
    "notes": "",
    "type": "Feat"
  },
  "Alert_minify": {
    "descriptionModels": [
      {
        "description": "Always on the lookout for danger, you gain the following benefits:\n\n- You can't be surprised while you are conscious.\n- You gain a +5 bonus to initiative.\n- Other creatures don't gain advantage on attack rolls against you as a result of being unseen by you",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Alert",
    "notes": "",
    "type": "Feat"
  },
  "Animal Handler_minify": {
    "descriptionModels": [
      {
        "description": "You master the techniques needed to train and handle animals. You gain the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Animal Handling skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You can use a bonus action on your turn to command one friendly beast within 60 feet of you that can hear you and that isn't currently following the command of someone else. You decide now what action the beast will take and where it will move during its next turn, or you issue a general command that lasts for 1 minute, such as to guard a particular area",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Animal Handler",
    "notes": "",
    "type": "Feat"
  },
  "Arcanist_minify": {
    "descriptionModels": [
      {
        "description": "You study the arcane arts, gaining the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the Arcana skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You learn the Prestidigitation and Detect Magic spells. You can cast Detect Magic once without expending a spell slot, and you regain the ability to do so when you finish a long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Arcanist",
    "notes": "",
    "type": "Feat"
  },
  "Artificer Initiate [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You've learned some of an artificer's inventiveness:\n\n- You learn one cantrip of your choice from the artificer spell list, and you learn one 1st-level spell of your choice from that list. Intelligence is your spellcasting ability for these spells.\n\n- You can cast this feat's 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.\n\n- You gain proficiency with one type of artisan's tools of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability",
        "level": 1
      }
    ],
    "id": "Customfad3838d-f444-4f5e-a699-70def2e2c0c0",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Artificer Initiate [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Athlete_minify": {
    "descriptionModels": [
      {
        "description": "You have undergone extensive physical training to gain the following benefits:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- When you are prone, standing up uses only 5 feet of your movement.\n- Climbing doesn't cost you extra movement.\n- You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Athlete",
    "notes": "",
    "type": "Feat"
  },
  "Barbed Hide_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Tiefling\n\nOne of your ancestors was a barbed devil or other spiky fiend. Barbs protrude from your head. You gain the following benefits:\n\n- Increase your Constitution or Charisma score by 1, up to a maximum of 20.\n\n- You gain proficiency in the Intimidation skill. If you're already proficient in it, your proficiency bonus is doubled for any check you make with it.\n\n- As a bonus action, you can cause small barbs to protrude all over your body or cause them to retract. At the start of each of your turns while the barbs are out, you deal 1d6 piercing damage to any creature grappling you or any creature grappled by you",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Barbed Hide",
    "notes": "",
    "type": "Feat"
  },
  "Blade Mastery_minify": {
    "descriptionModels": [
      {
        "description": "You master the shortsword, longsword, scimitar, rapier, and greatsword. You gain the following benefits when using any of them:\n\n- You gain a +1 bonus to attack rolls you make with the weapon.\n- On your turn, you can use your reaction to assume a parrying stance, provided you have the weapon in hand. Doing so grants a +1 bonus to your AC until the start of your next turn or until you're not holding the weapon.\n- When you make an opportunity attack with the weapon, you have advantage on the attack roll",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Blade Mastery",
    "notes": "",
    "type": "Feat"
  },
  "Bountiful Luck_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Halfling\n\nYour people have extraordinary luck, which you have learned to mystically lend to your companions whenever you see them falter. You're not sure how you do it, you just wish it, and it happens. Surely a sign of fortune's favor!\n\nWhen an ally you can see within 30 feet of you rolls a 1 on the d20 for an attack roll, an ability check, or a saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll.\n\nWhen you use this ability, you can't use your Lucky racial trait before the end of your next turn",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Bountiful Luck",
    "notes": "",
    "type": "Feat"
  },
  "Brawny_minify": {
    "descriptionModels": [
      {
        "description": "You become stronger, gaining the following benefits:\n\n- Increase your Strength score by 1, to a maximum of 20.\n- You gain proficiency in the Athletics skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You count as if you were one size larger for the purpose of determining your carrying capacity",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Brawny",
    "notes": "",
    "type": "Feat"
  },
  "Burglar_minify": {
    "descriptionModels": [
      {
        "description": "You pride yourself on your quickness and your close study of certain clandestine activities. You gain the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n\n- You gain proficiency with thieves' tools. If you are already proficient with them, you add double your proficiency bonus to checks you make with them",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Burglar",
    "notes": "",
    "type": "Feat"
  },
  "Charger_minify": {
    "descriptionModels": [
      {
        "description": "When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature. If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack's damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed)",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Charger",
    "notes": "",
    "type": "Feat"
  },
  "Chef [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "Time spent mastering the culinary arts has paid off, granting you the following benefits:\n\n- Increase your Constitution or Wisdom by 1, to a maximum of 20.\n\n- You gain proficiency with cook's utensils if you don't already have it.\n\n- As part of a short rest, you can cook special food, provided you have ingredients and cook's utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra 1d8 hit points.\n\n- With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to your proficiency bonus",
        "level": 1
      }
    ],
    "id": "Custom69f336bb-1988-4a8c-9c6d-6cbad3cb4b2b",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Chef [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Critter Friend_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Gnome (forest)\n\nYour friendship with animals mystically deepens. You gain the following benefits:\n\n- You gain proficiency in the Animal Handling skill. If you're already proficient in it, your proficiency bonus is doubled for any check you make with it.\n\n- You learn the Speak with Animals spell and can cast it at will, without expending a spell slot. You also learn the Animal Friendship spell, and you can cast it once with this feat, without expending a spell slot. You regain the ability to cast it in this way when you finish a long rest. Wisdom is your spellcasting ability for these spells",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Critter Friend",
    "notes": "",
    "type": "Feat"
  },
  "Crossbow Expert_minify": {
    "descriptionModels": [
      {
        "description": "Thanks to extensive practice with the crossbow, you gain the following benefits:\n\n- You ignore the loading quality of crossbows with which you are proficient.\n- Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.\n- When you use the Attack action and attack with a one handed weapon, you can use a bonus action to attack with a hand crossbow you are holding",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Crossbow Expert",
    "notes": "",
    "type": "Feat"
  },
  "Crusher [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You are practiced in the art of crushing your enemies, granting you the following benefits:\n\n- Increase your Strength or Constitution by 1, to a maximum of 20.\n\n- Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.\n\n- When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the start of your next turn",
        "level": 1
      }
    ],
    "id": "Custom95853e06-4f83-43e5-a554-c5e0645bdc2e",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Crusher [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Defensive Duelist_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dexterity 13 or higher\n\nWhen you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing it to miss you",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Defensive Duelist",
    "notes": "",
    "type": "Feat"
  },
  "Diplomat_minify": {
    "descriptionModels": [
      {
        "description": "You master the arts of diplomacy, gaining the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency in the Persuasion skill. If you are already proficient in this skill, you add double your proficiency bonus to checks you make with it.\n- If you spend 1 minute talking to someone who can understand what you say, you can make a Persuasion check contested by the creature's Insight check. If you or your companions are fighting the creature, your check automatically fails. If your check succeeds, the target is charmed by you as long as it remains within 60 feet of you and for 1 minute thereafter",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Diplomat",
    "notes": "",
    "type": "Feat"
  },
  "Divinely_Favored_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level.\n\nA god chose you to carry a spark of their power.\nYou learn one cantrip of your choice from the cleric spell list and one 1st-level spell based on the alignment of your character, as specified in the Alignment Spells table below. You also learn the augury spell.\n\nAlignment Spells\nAlignment --> 1st-Level Spell\nEvil --> Choose one 1st-level warlock spell\nGood --> Choose one 1st-level cleric spell\nNeutral --> Choose one 1st-level druid spell\n\nYou can cast the chosen 1st-level spell and the augury spell without a spell slot, and you must finish a long rest before you can cast either of these spells in this way again. You can also cast these spells using spell slots you have of the appropriate level.\n\nYour spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat).\n\nIn addition, you can use a holy symbol as a spellcasting focus for any spell you cast that uses the spellcasting ability you choose when you select this feat",
        "level": 4
      }
    ],
    "id": "Custom503d1879-3a7a-4bed-a8ee-83bf49d3662a",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Divinely Favored [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Dragon Fear_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dragonborn\n\nWhen angered, you radiate menace. You gain the following benefits:\n\n- Increase your Strength, Constitution, or Charisma score by 1, to a maximum of 20.\n\n- Instead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 30 feet of you to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Charisma modifier). A target automatically succeeds on the save if it can't hear or see you. On a failed save, a target becomes frightened for 1 minute. If the frightened target takes any damage, it can repeat the saving throw, ending the effect on itself on a success",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Dragon Fear",
    "notes": "",
    "type": "Feat"
  },
  "Dragon Hide_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dragonborn\n\nYou manifest scales and claws reminiscent of your draconic ancestors. You gain the following benefits:\n\n- Increase your Strength, Constitution, or Charisma score by 1, up to a maximum of 20.\n\n- Your scales harden. While you aren't wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a shield and still gain this benefit.\n\n- You can grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Dragon Hide",
    "notes": "",
    "type": "Feat"
  },
  "Dragon Wings_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dragonborn\n\nYou sprout draconic wings. With your wings, you have a flying speed of 20 feet if you aren't wearing heavy armor and aren't exceeding your carrying capacity",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Dragon Wings",
    "notes": "",
    "type": "Feat"
  },
  "Drow High Magic_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Elf (drow)\n\n- You learn more of the magic typical of dark elves. \n\n- You learn the Detect Magic spell and can cast it at will, without expending a spell slot. You also learn Levitate and Dispel Magic, each of which you can cast once without expending a spell slot. \n\n- You regain the ability to cast the spell in this way when you finish a long rest. Charisma is your spellcasting ability for these spells",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Drow High Magic",
    "notes": "",
    "type": "Feat"
  },
  "Dual Wielder_minify": {
    "descriptionModels": [
      {
        "description": "You master fighting with two weapons, gaining the following benefits:\n\n- You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.\n- You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light.\n- You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Dual Wielder",
    "notes": "",
    "type": "Feat"
  },
  "Dungeon Delver_minify": {
    "descriptionModels": [
      {
        "description": "Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:\n\n- You have advantage on Perception and Investigation checks made to detect the presence of secret doors.\n- You have advantage on saving throws made to avoid or resist traps.\n- You have resistance to the damage dealt by traps.\n- Traveling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom (Perception) score",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Dungeon Delver",
    "notes": "",
    "type": "Feat"
  },
  "Durable_minify": {
    "descriptionModels": [
      {
        "description": "Hardy and resilient, you gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n- When you roll a Hit Die to regain hit points, the minimum number of hit points you regain equals twice your Constitution modifier (minimum of 2)",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Durable",
    "notes": "",
    "type": "Feat"
  },
  "Dwarven Fortitude_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dwarf\n\nYou have the blood of dwarf heroes flowing through your veins. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n\n- Whenever you take the Dodge action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1)",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Dwarven Fortitude",
    "notes": "",
    "type": "Feat"
  },
  "Eldritch Adept [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Spellcasting or Pact Magic feature\n\nStudying occult lore, you have unlocked eldritch power within yourself: you learn one Eldritch Invocation option of your choice from the warlock class. If the invocation has a prerequisite of any kind, you can choose that invocation only if you're a warlock who meets the prerequisite.\n\nWhenever you gain a level, you can replace the invocation with another one from the warlock class",
        "level": 1
      }
    ],
    "id": "Custom2c7cb32c-94e1-4c87-a568-c2d477ec8422",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Eldritch Adept [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Elemental Adept_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: The ability to cast at least one spell\n\nWhen you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n\nSpells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.\n\nYou can select this feat multiple times. Each time you do so, you must choose a different damage type",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Elemental Adept",
    "notes": "",
    "type": "Feat"
  },
  "Elven Accuracy_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Elf or half-elf\n\nThe accuracy of elves is legendary, especially that of elf archers and spellcasters. You have uncanny aim with attacks that rely on precision rather than brute force. You gain the following benefits:\n\n- Increase your Dexterity, Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20\n\n- Whenever you have advantage on an attack roll using Dexterity, Intelligence, Wisdom, or Charisma, you can reroll one of the dice once",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Elven Accuracy",
    "notes": "",
    "type": "Feat"
  },
  "Empathic_minify": {
    "descriptionModels": [
      {
        "description": "You possess keen insight into how other people think and feel. You gain the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Insight skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You can use your action to try to get uncanny insight about one humanoid you can see within 30 feet of you. Make an Insight check contested by the target's Deception. If your check succeeds, you have advantage on attack rolls and ability checks against the target until the end of your next turn",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Empathic",
    "notes": "",
    "type": "Feat"
  },
  "Everybody's Friend_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Half-elf\n\nYou develop your magnetic personality to ease your way through the world. You gain the following benefits:\n\n- Increase your Charisma score by 1, up to a maximum of 20.\n\n- You gain proficiency in the Deception and Persuasion skills. If you're already proficient in either skill, your proficiency bonus is doubled for any check you make with that skill",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Everybody's Friend",
    "notes": "",
    "type": "Feat"
  },
  "Fade Away_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Gnome\n\nYour people are clever, with a knack for illusion magic. You have learned a magical trick for fading away when you suffer harm. You gain the following benefits:\n\n- Increase your Dexterity or Intelligence score by 1, to a maximum of 20.\n\n- Immediately after you take damage, you can use a reaction to magically become invisible until the end of your next turn or until you attack, deal damage, or force someone to make a saving throw. Once you use this ability, you can't do so again until you finish a short or long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Fade Away",
    "notes": "",
    "type": "Feat"
  },
  "Fell Handed_minify": {
    "descriptionModels": [
      {
        "description": "You master the handaxe, battleaxe, greataxe, warhammer, and maul. You gain the following benefits when using any of them:\n\n- You gain a +1 bonus to attack rolls you make with the weapon.\n- Whenever you have advantage on a melee attack roll you make with the weapon and hit, you can knock the target prone if the lower of the two d20 rolls would also hit the target.\n- Whenever you have disadvantage on a melee attack roll you make with the weapon, the target takes bludgeoning damage equal to your Strength modifier (minimum of 0) if the attack misses but if the higher of the two d20 rolls would have hit.\n- If you use the Help action to aid an ally's melee attack while you're wielding the weapon, you knock the target's shield aside momentarily. In addition to the ally gaining advantage on the attack roll, the ally gains a +2 bonus to the roll if the target is using a shield",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Fell Handed",
    "notes": "",
    "type": "Feat"
  },
  "Fey Teleportation_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Elf (high)\n\nYour study of high elven lore has unlocked fey power that few other elves possess, except your eladrin cousins. Drawing on your fey ancestry, you can momentarily stride through the Feywild to shorten your path from one place to another. You gain the following benefits:\n\n- Increase your Intelligence or Charisma score by 1, to a maximum of 20.\n\n- You learn to speak, read, and write Sylvan\n\n- You learn the Misty Step spell and can cast it once without expending a spell slot. You regain the ability to cast it in this way when you finish a short or long rest. Intelligence is your spellcasting ability for this spell",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Fey Teleportation",
    "notes": "",
    "type": "Feat"
  },
  "Fey Touched [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "Your exposure to the Feywild's magic has changed you, granting you the following benefits:\n\n- Increase your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- You learn the misty step spell and one 1st-level spell of your choice. The 1st-level spell must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat",
        "level": 1
      }
    ],
    "id": "Custombd941f2e-49c7-413d-b420-8714675e58c2",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Fey Touched [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Fighting Initiate [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Proficiency with a martial weapon\n\nYour martial training has helped you develop a particular style of fighting. As a result, you learn one Fighting Style option of your choice from the fighter class. If you already have a style, the one you choose must be different.\nWhenever you reach a level that grants the Ability Score Improvement feature, you can replace this feat's fighting style with another one from the fighter class that you don't have",
        "level": 1
      }
    ],
    "id": "Custom6139144b-b662-4be4-a0b2-13dab2584d4e",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Fighting Initiate [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Flail Mastery_minify": {
    "descriptionModels": [
      {
        "description": "The flail is a tricky weapon to use, but you have spent countless hours mastering it. You gain the following benefits.\n\n- You gain a +1 bonus to attack rolls you make with the weapon.\n- As a bonus action on your turn, you can prepare yourself to extend your flail to sweep over targets' shields. Until the end of this turn, your attack rolls with a flail gain a +2 bonus against any target using a shield.\n- When you hit with an opportunity attack using a flail, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier) or be knocked prone",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Flail Mastery",
    "notes": "",
    "type": "Feat"
  },
  "Flames of Phlegethos_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Tiefling\n\nYou learn to call on hellfire to serve your commands. You gain the following benefits:\n\n- Increase your Intelligence or Charisma score by 1, to a maximum of 20.\n\n- When you roll fire damage for a spell you cast, you can reroll any roll of 1 on the fire damage dice, but you must use the new roll, even if it is another 1.\n\n- Whenever you cast a spell that deals fire damage, you can cause flames to wreathe you until the end of your next turn. The flames don't harm you or your possessions, and they shed bright light out to 30 feet and dim light for an additional 30 feet. While the flames are present, any creature within 5 feet of you that hits you with a melee attack takes 1d4 fire damage",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Flames of Phlegethos",
    "notes": "",
    "type": "Feat"
  },
  "Gift_of_the_Chromatic_Dragon_[FTD]_minify": {
    "descriptionModels": [
      {
        "description": "You gain the following benefits:\n\n- Chromatic Infusion: As a bonus action, you can touch a simple or martial weapon and infuse it with one of the following damage types: acid, cold, fire, lightning, or poison. For the next minute, the weapon deals an extra 1d4 damage of the chosen type when it hits. After you use this bonus action, you can't do so again until you finish a long rest.\n\n- Reactive Resistance: When you take acid, cold, fire, lightning, or poison damage, you can use your reaction to give yourself resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Custom6384b0c0-1b92-4f01-b6f9-6e97454b4eaa",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gift of the Chromatic Dragon [FTD]",
    "notes": "",
    "type": "Feat"
  },
  "Gift_of_the_Chromatic_Dragon_[UA]_minify": {
    "descriptionModels": [
      {
        "description": "You’ve manifested some of the power of chromatic dragons, granting you the following benefits:\n\n- As a bonus action, you can touch a simple or martial weapon and infuse it with one of the following damage types: acid, cold, fire, lightning, or poison. For the next minute, the weapon deals an extra 1d4 damage of the chosen type when it hits. After you use this ability, you can’t do so again until you finish a long rest.\n\n- When you take acid, cold, fire, lightning, or poison damage, you can use your reaction to give yourself resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Customaebb1c6c-f03c-47de-a983-ada00cfeb112",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gift of the Chromatic Dragon [UA]",
    "notes": "",
    "type": "Feat"
  },
  "Gift_of_the_Gem_Dragon_[FTD]_minify": {
    "descriptionModels": [
      {
        "description": "You gain the following benefits:\n\n- Ability Score Increase: Increase your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- Telekinetic Reprisal: When you take damage from a creature that is within 10 feet of you, you can use your reaction to emanate telekinetic energy. The creature that dealt damage to you must make a Strength saving throw (DC equals 8 + your proficiency bonus + the ability modifier of the score increased by this feat). On a failed save, the creature takes 2d8 force damage and is pushed up to 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Customd5b6ec11-3571-4d01-8f57-51f116d191f1",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gift of the Gem Dragon [FTD]",
    "notes": "",
    "type": "Feat"
  },
  "Gift_of_the_Gem_Dragon_[UA]_minify": {
    "descriptionModels": [
      {
        "description": "You’ve manifested some of the power of gem dragons, granting you the following benefits:\n\n- Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n\n- When you take damage from a creature that is within 10 feet of you, you can use your reaction to emanate telekinetic energy. The creature that dealt damage to you must succeed on a Strength saving throw (DC equals 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or take 2d8 force damage and be pushed 10 feet away from you. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Customb1c581b1-4093-47f6-a548-45244b97a0e0",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gift of the Gem Dragon [UA]",
    "notes": "",
    "type": "Feat"
  },
  "Gift_of_the_Metallic_Dragon_[FTD]_minify": {
    "descriptionModels": [
      {
        "description": "You gain the following benefits:\n\n- Draconic Healing: You learn the cure wounds spell. You can cast this spell without expending a spell slot. Once you cast this spell in this way, you can't do so again until you finish a long rest. You can also cast this spell using spell slots you have. The spell's spellcasting ability is Intelligence, Wisdom, or Charisma when you cast it with this feat (choose when you gain the feat).\n\n- Protective Wings: You can manifest protective wings that can shield you or others. When you or another creature you can see within 5 feet of you is hit by an attack roll, you can use your reaction to manifest spectral wings from your back for a moment. You grant a bonus to the target's AC equal to your proficiency bonus against that attack roll, potentially causing it to miss. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Customddd811f4-aa37-42ec-a5d5-693cf5e12c2a",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gift of the Metallic Dragon [FTD]",
    "notes": "",
    "type": "Feat"
  },
  "Gift_of_the_Metallic_Dragon_[UA]_minify": {
    "descriptionModels": [
      {
        "description": "You’ve manifested some of the power of metallic dragons, granting you the following benefits:\n\n- You learn the cure wounds spell. You can cast this spell without expending a spell slot. Once you cast this spell in this way, you can’t do so again until you finish a long rest. You can also cast this spell using spell slots you have. The spell’s spellcasting ability is Intelligence, Wisdom, or Charisma when you cast it with this feat (choose when you gain the feat).\n\n- You can manifest protective wings that can shield you or others from attacks. When you or another creature you can see within 5 feet of you is hit by an attack roll, you can use your reaction to manifest spectral wings from your back for a moment. Roll a d4 and grant a bonus to the target’s AC equal to the number rolled against that attack roll, potentially causing it to miss. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
        "level": 1
      }
    ],
    "id": "Custome09d5e35-70f7-47af-a73d-b6894f0e55fe",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gift of the Metallic Dragon [UA]",
    "notes": "",
    "type": "Feat"
  },
  "Gourmand_minify": {
    "descriptionModels": [
      {
        "description": "You have mastered a variety of special recipes, allowing you to prepare exotic dishes with useful effects. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n\n- You gain proficiency with cook's utensils. If you are already proficient with them, you add double your proficiency bonus to checks you make with them.\n\n- As an action, you can inspect a drink or plate of food within 5 feet of you and determine whether it is poisoned, provided that you can see and smell it.\n\n- During a long rest, you can prepare and serve a meal that helps you and your allies recover from the rigors of adventuring, provided you have suitable food, cook's utensils, and other supplies on hand. The meal serves up to six people, and each person who eats it regains two additional Hit Dice at the end of the long rest. In addition, those who partake of the meal have advantage on Constitution saving throws against disease for the next 24 hours",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gourmand",
    "notes": "",
    "type": "Feat"
  },
  "Grappler_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Strength 13 or higher\n\nYou've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:\n\n- You have advantage on attack rolls against a creature you are grappling.\n- You can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both restrained until the grapple ends",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Grappler",
    "notes": "",
    "type": "Feat"
  },
  "Great Weapon Master_minify": {
    "descriptionModels": [
      {
        "description": "You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:\n\n- On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.\n- Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Great Weapon Master",
    "notes": "",
    "type": "Feat"
  },
  "Greater Dragonmark_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: 8th level, have a dragonmark\n\nYour dragonmark has grown in size and power. This enhances your existing dragonmark, and the benefits are based on the mark that you already possess. A greater dragonmark provides the following benefits:\n\n- The die type of your dragonmarked Intuition Die increases by one.\n\n- Increase one ability score by 1, to a maximum of 20. The abilities available to you are based on your mark, as shown on the Greater Dragonmark Benefits table.\n\n- You learn a set of spells, each of which you can cast once without expending a spell slot or using a material component. The list of spells, the spellcasting ability for them, and the type of rest you must complete to regain the use of these spells are shown on the Greater Dragonmark Benefits table.\n\n- To cast Leomund's Secret Chest using this feat and the Mark of Warding, you must have a Siberys dragonshard with a value of at least 100 gp. It serves as a focus for the spell and replaces the tiny chest's replica",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Greater Dragonmark",
    "notes": "",
    "type": "Feat"
  },
  "Grudge-Bearer_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dwarf\n\nYou have a deep hatred for a particular kind of creature. Choose your foes, a type of creature to bear the burden of your wrath: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can choose two races of humanoid (such as gnolls and orcs). You gain the following benefits:\n\n- Increase your Strength, Constitution, or Wisdom score by 1, to a maximum of 20.\n\n- During the first round of any combat against your chosen foes, your attack rolls against any of them have advantage.\n\n- When any of your chosen foes makes an opportunity attack against you, it makes the attack roll with disadvantage.\n\n- Whenever you make an Intelligence (Arcana, History, Nature, or Religion) check to recall information about your chosen foes, you add double your proficiency bonus to the check, even if you're not normally proficient",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Grudge-Bearer",
    "notes": "",
    "type": "Feat"
  },
  "Gunner [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You have a quick hand and keen eye when employing firearms, granting you the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n\n- You gain proficiency with firearms.\nYou ignore the loading property of firearms.\n\n- Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls",
        "level": 1
      }
    ],
    "id": "Custom3835fdd8-61c4-43cd-9529-af7e9bacaaff",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Gunner [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Healer_minify": {
    "descriptionModels": [
      {
        "description": "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:\n\n- When you use a healer's kit to stabilize a dying creature, that creature also regains 1 hit point.\n- As an action, you can spend one use of a healer's kit to tend to a creature and restore 1d6 + 4 hit points to it, plus additional hit points equal to the creature's maximum number of hit dice. The creature can't regain hit points from this feat again until it finishes a short or long rest.",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Healer",
    "notes": "",
    "type": "Feat"
  },
  "Heavily Armored_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Proficiency with medium armor\n\nYou have trained to master the use of heavy armor, gaining the following benefits:\n\n- Increase your Strength score by 1, to a maximum of 20.\n- You gain proficiency with heavy armor",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Heavily Armored",
    "notes": "",
    "type": "Feat"
  },
  "Heavy Armor Master_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Proficiency with heavy armor\n\nYou can use your armor to deflect strikes that would kill others. You gain the following benefits:\n\n- Increase your Strength score by 1, to a maximum of 20.\n- While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from non-magical weapons is reduced by 3",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Heavy Armor Master",
    "notes": "",
    "type": "Feat"
  },
  "Historian_minify": {
    "descriptionModels": [
      {
        "description": "Your study of history rewards you with the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the History skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- When you take the Help action to aid another creature's ability check, you can make a DC 15 History check. On a success, that creature's check gains a bonus equal to your proficiency bonus, as you share pertinent advice and historical examples. To receive this bonus, the creature must be able to understand what you're saying",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Historian",
    "notes": "",
    "type": "Feat"
  },
  "Human Determination_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Human\n\nYou are filled with a determination that can draw the unreachable within your reach. You gain the following benefits:\n\n- Increase one ability score of your choice by 1, to a maximum of 20.\n\n- When you make an attack roll, an ability check, or a saving throw, you can do so with advantage. Once you use this ability, you can't use it again until you finish a short or long rest.",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Human Determination",
    "notes": "",
    "type": "Feat"
  },
  "Infernal Constitution_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Tiefling\n\nFiendish blood runs strong in you, unlocking a resilience akin to that possessed by some fiends. You gain the following benefits:\n\n- Increase your Constitution score by 1, up to a maximum of 20.\n\n- You have resistance to cold damage and poison damage.\n\n- You have advantage on saving throws against being poisoned",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Infernal Constitution",
    "notes": "",
    "type": "Feat"
  },
  "Initiate_of_High_Sorcery_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: Sorcerer, Wizard, or Mage of High Sorcery\n\nYou've received training from magic-users affiliated with the Mages of High Sorcery.\nChoose one of the three moons of Krynn to influence your magic: the black moon, Nuitari; the red moon, Lunitari; or the white moon, Solinari. You learn one cantrip of your choice from the wizard spell list and two 1st-level spells based on the moon you choose, as specified in the Lunar Spells table.\n\nLunar Spells\nMoon --> 1st-Level Spell\nNuitari --> Choose two from dissonant whispers, false life, hex, and ray of sickness\nLunitari --> Choose two from color spray, disguise self, feather fall, and longstrider\nSolinari --> Choose two from comprehend languages, detect evil and good, protection from evil and good, and shield\n\nYou can cast each of the chosen 1st-level spells without a spell slot, and you must finish a long rest before you can cast them in this way again. You can also cast the spells using any spell slots you have.\n\nYour spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)",
        "level": 1
      }
    ],
    "id": "Customea4840f8-bec8-483b-849b-d5ff4619572b",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Initiate of High Sorcery [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Inspiring Leader_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Charisma 13 or higher\n\nYou can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points from this feat again until it has finished a short or long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Inspiring Leader",
    "notes": "",
    "type": "Feat"
  },
  "Investigator_minify": {
    "descriptionModels": [
      {
        "description": "You have an eye for detail and can pick out the smallest clues. You gain the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the Investigation skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You can take the Search action as a bonus action",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Investigator",
    "notes": "",
    "type": "Feat"
  },
  "Keen Mind_minify": {
    "descriptionModels": [
      {
        "description": "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You always know which way is north.\n- You always know the number of hours left before the next sunrise or sunset.\n- You can accurately recall anything you have seen or heard within the past month",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Keen Mind",
    "notes": "",
    "type": "Feat"
  },
  "Knight_of_the_Crown_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, squire of solamnia feat\n\nYou are a Knight of Solamnia aligned with the Order of the Crown, a group that extols the virtues of cooperation, loyalty, and obedience. You excel in group combat and gain these benefits:\n\n- Ability Score Increase: Increase your Strength, Dexterity, or Constitution by 1, to a maximum of 20.\n\n- Commanding Rally: As a bonus action, you can command one ally within 30 feet of yourself to attack. If that ally can see or hear you, they can immediately make one weapon attack as a reaction. If the attack hits, the ally can roll a d8 and add the number rolled as a bonus to the attack's damage roll. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom0a32db54-7847-42b4-8ad4-96ea0fc11596",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Knight of the Crown [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Knight_of_the_Rose_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, squire of solamnia feat\n\nYou are a Knight of Solamnia aligned with the Order of the Rose, a group known for leadership, justice, and wisdom. Your resolve grants you these benefits:\n\n- Ability Score Increase: Increase your Constitution, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- Bolstering Rally: As a bonus action, you can encourage one creature you can see within 30 feet of yourself (you can choose yourself). If the target can see or hear you, the target gains temporary hit points equal to 1d8 + your proficiency bonus + the ability modifier of the ability score increased by this feat. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Customcff5fd56-5afa-49d2-a75a-fb620f9736ff",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Knight of the Rose [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Knight_of_the_Sword_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, squire of solamnia feat\n\nYou are a Knight of Solamnia aligned with the Order of the Sword, a group devoted to heroism and courage. Bravery steels your spirit, granting you these benefits:\n\n- Ability Score Increase: Increase your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- Demoralizing Strike: Once per turn, when you hit a creature with a weapon attack roll, you can attempt to frighten that target. The target must make a Wisdom saving throw (DC equals 8 + your proficiency bonus + the ability modifier of the score increased by this feat). On a failed save, the target is frightened of you until the end of your next turn. On a successful save, the target has disadvantage on the next attack roll it makes before the end of its next turn. You can use this benefit a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom40b518e2-10d5-4e91-be1e-f43962971a85",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Knight of the Sword [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Lightly Armored_minify": {
    "descriptionModels": [
      {
        "description": "You have trained to master the use of light armor, gaining the following benefits:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- You gain proficiency with light armor",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Lightly Armored",
    "notes": "",
    "type": "Feat"
  },
  "Linguist_minify": {
    "descriptionModels": [
      {
        "description": "You have studied languages and codes, gaining the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You learn three languages of your choice.\n- You can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Linguist",
    "notes": "",
    "type": "Feat"
  },
  "Lucky_minify": {
    "descriptionModels": [
      {
        "description": "You have inexplicable luck that seems to kick in at just the right moment.\n\nYou have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw.\n\nYou can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker's roll or yours.\n\nIf more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.\n\nYou regain your expended luck points when you finish a long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Lucky",
    "notes": "",
    "type": "Feat"
  },
  "Mage Slayer_minify": {
    "descriptionModels": [
      {
        "description": "You have practiced techniques useful in melee combat against spell casters, gaining the following benefits:\n\n- When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.\n- When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.\n- You have advantage on saving throws against spells cast by creatures within 5 feet of you",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Mage Slayer",
    "notes": "",
    "type": "Feat"
  },
  "Magic Initiate_minify": {
    "descriptionModels": [
      {
        "description": "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class's spell list.\n\nIn addition, choose one 1st-level spell from that same list. You learn that spell and, using this feat, can cast it at its lowest level. Once you cast it in this way, you must finish a long rest before you can cast it in this way again.\n\nYour spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Magic Initiate",
    "notes": "",
    "type": "Feat"
  },
  "Martial Adept_minify": {
    "descriptionModels": [
      {
        "description": "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:\n\n- You learn two maneuvers of your choice from among those available to the Battle Master archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n- If you already have superiority dice, you gain one more; otherwise, you have one superiority die, which is a d6. These dice are used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Martial Adept",
    "notes": "",
    "type": "Feat"
  },
  "Master of Disguise_minify": {
    "descriptionModels": [
      {
        "description": "You have honed your ability to shape your personality and to read the personalities of others. You gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n\n- You gain proficiency with the disguise kit. If you are already proficient with it, you add double your proficiency bonus to checks you make with it.\n\n- If you spend 1 hour observing a creature, you can then spend 8 hours crafting a disguise you can quickly don to mimic that creature. Making the disguise requires a disguise kit. You must make checks as normal to disguise yourself, but you can assume the disguise as an action",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Master of Disguise",
    "notes": "",
    "type": "Feat"
  },
  "Medic_minify": {
    "descriptionModels": [
      {
        "description": "You master the physician's arts, gaining the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Medicine skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- During a short rest, you can clean and bind the wounds of up to six willing beasts and humanoids. Make a DC 15 Medicine check for each creature. On a success, if a creature spends a Hit Die during this rest, that creature can forgo the roll and instead regain the maximum number of hit points the die can restore. A creature can do so only once per rest, regardless of how many Hit Dice it spends",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Medic",
    "notes": "",
    "type": "Feat"
  },
  "Medium Armor Master_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Proficiency with medium armor\n\nYou have practiced moving in medium armor to gain the following benefits:\n\n- Wearing medium armor doesn't impose disadvantage on your Dexterity (Stealth) checks.\n- When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Medium Armor Master",
    "notes": "",
    "type": "Feat"
  },
  "Menacing_minify": {
    "descriptionModels": [
      {
        "description": "You become fearsome to others, gaining the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency in the Intimidation skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- When you take the Attack action on your turn, you can replace one attack with an attempt to demoralize one humanoid you can see within 30 feet of you that can see and hear you. Make a Intimidation check contested by the target's Insight. If your check succeeds, the target is frightened until the end of your next turn. If your check fails, the target can't be frightened by you in this way for 1 hour",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Menacing",
    "notes": "",
    "type": "Feat"
  },
  "Metamagic Adept [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Spellcasting or Pact Magic feature\n\nYou've learned how to exert your will on your spells to alter how they function:\n\n- You learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you reach a level that grants the Ability Score Improvement feature, you can replace one of these Metamagic options with another one from the sorcerer class.\n\n- You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Custom3f0b78e9-7032-40ad-9f56-6efc7619f04a",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Metamagic Adept [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Mobile_minify": {
    "descriptionModels": [
      {
        "description": "You are exceptionally speedy and agile. You gain the following benefits:\n\n- Your speed increases by 10 feet.\n- When you use the Dash action, difficult terrain doesn't cost you extra movement on that turn.\n- When you make a melee attack against a creature, you don't provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Mobile",
    "notes": "",
    "type": "Feat"
  },
  "Moderately Armored_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Proficiency with light armor\n\nYou have trained to master the use of medium armor and shields, gaining the following benefit:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- You gain proficiency with medium armor and shields",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Moderately Armored",
    "notes": "",
    "type": "Feat"
  },
  "Mounted Combatant_minify": {
    "descriptionModels": [
      {
        "description": "You are a dangerous foe to face while mounted. While you are mounted and aren't incapacitated, you gain the following benefits:\n\n- You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.\n- You can force an attack targeted at your mount to target you instead.\n- If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Mounted Combatant",
    "notes": "",
    "type": "Feat"
  },
  "Naturalist_minify": {
    "descriptionModels": [
      {
        "description": "Your extensive study of nature rewards you with the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n\n- You gain proficiency in the Nature skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- You learn the Druidcraft and Detect Poison and Disease spells. You can cast Detect Poison and Disease once without expending a spell slot, and you regain the ability to do so when you finish a long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Naturalist",
    "notes": "",
    "type": "Feat"
  },
  "Observant_minify": {
    "descriptionModels": [
      {
        "description": "Quick to notice details of your environment, you gain the following benefits:\n\n- Increase your Intelligence or Wisdom score by 1, to a maximum of 20.\n- If you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips.\n- You have a +5 bonus to your passive Perception and Investigation scores",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Observant",
    "notes": "",
    "type": "Feat"
  },
  "Orcish Aggression_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Half-orc\n\nAs a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Orcish Aggression",
    "notes": "",
    "type": "Feat"
  },
  "Orcish Fury_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Half-orc\n\nYour fury burns tirelessly. You gain the following benefits:\n\n- Increase your Strength or Constitution score by 1, up to a maximum of 20.\n\n- When you hit with an attack made with a simple or martial weapon, you can roll one of the weapon's damage dice an additional time and add it as extra damage of the weapon's damage type. Once you use this ability, you can't use it again until you finish a short or long rest.\nImmediately after you use your Relentless Endurance trait, you can use your reaction to make one weapon attack",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Orcish Fury",
    "notes": "",
    "type": "Feat"
  },
  "Perceptive_minify": {
    "descriptionModels": [
      {
        "description": "You hone your senses until they become razor sharp. You gain the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n\n- You gain proficiency in the Perception skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- Being in a lightly obscured area doesn't impose disadvantage on your Perception checks if you can both see and hear",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Perceptive",
    "notes": "",
    "type": "Feat"
  },
  "Performer_minify": {
    "descriptionModels": [
      {
        "description": "You master performance so that you can command any stage. You gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n\n- You gain proficiency in the Performance skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- While performing, you can try to distract one humanoid you can see. The humanoid must see and hear you. Make a Performance check contested by the humanoid's Insight check. If your check succeeds, you grab the humanoid's attention enough that it makes Perception and Investigation checks with disadvantage until you stop performing",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Performer",
    "notes": "",
    "type": "Feat"
  },
  "Piercer [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You have achieved a penetrating precision in combat, granting you the following benefits:\n\n- Increase your Strength or Dexterity by 1, to a maximum of 20.\n\n- Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.\n\n- When you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes",
        "level": 1
      }
    ],
    "id": "Custom55f00c1c-5651-4429-9db2-be58ffd9ce75",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Piercer [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Poisoner [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You can prepare and deliver deadly poisons, granting you the following benefits:\n\n- When you make a damage roll that deals poison damage, it ignores resistance to poison damage.\n\n- You can apply poison to a weapon or piece of ammunition as a bonus action, instead of an action.\n\n- You gain proficiency with the poisoner's kit if you don't already have it. With one hour of work using a poisoner's kit and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution saving throw or take 2d8 poison damage and become poisoned until the end of your next turn",
        "level": 1
      }
    ],
    "id": "Custom2645c907-58a3-4cf6-8f93-4321ced15b7b",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Poisoner [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Polearm Master_minify": {
    "descriptionModels": [
      {
        "description": "You can keep your enemies at bay with reach weapons. You gain the following benefits:\n\n- When you take the Attack action and attack with only a glaive, halberd, quarterstaff or spear, you can use a bonus action to make a melee attack with the opposite end of the weapon. The weapon's damage die for this attack is a d4, and the attack deals bludgeoning damage. This attack uses the same ability modifier as the primary attack.\n- While you are wielding a glaive, halberd, pike, quarterstaff or spear, other creatures provoke an opportunity attack from you when they enter the reach you have with that weapon",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Polearm Master",
    "notes": "",
    "type": "Feat"
  },
  "Prodigy_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Half-elf, half-orc or human\n\nYou have a knack for learning new things. You gain the following benefits:\n\n- You gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.\n\n- Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Prodigy",
    "notes": "",
    "type": "Feat"
  },
  "Quick-Fingered_minify": {
    "descriptionModels": [
      {
        "description": "Your nimble fingers and agility let you perform sleight of hand. You gain the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n\n- You gain proficiency in the Sleight of Hand skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- As a bonus action, you can make a Sleight of Hand check to plant something on someone else, conceal an object on a creature, lift a purse, or take something from a pocket",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Quick-Fingered",
    "notes": "",
    "type": "Feat"
  },
  "Quicksmithing_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Intelligence 13 or higher\n\nYou have mastered the art of on-the-fly invention, improvement, and jury-rigging. You can use your talents to create immediate, short-term magical effects similar to spells, given time and an adequate supply of aether.\n\nWhen you choose this feat, you master two magical effects, each of which recreates the effect of a 1st-level spell that has the ritual tag. These spells can come from any class list, but Intelligence is your spellcasting ability for them.\n\nIf you come across a schematic geared toward quicksmithing or study with another quicksmith, you might be able to add another spell to the effects you have mastered. The spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of mastering the spell takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents aether you use as you experiment with the spell effect to master it.\n\nIn addition, you have proficiency with artisan's tools (quicksmith's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours unless you spend 1 hour repairing it to keep it functioning. You can use your action to dismantle the device, at which point you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n\nWhen you create a device, choose one of the following options:\n\n- Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction\n\n- Fire Starter. This device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n\n- Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Quicksmithing",
    "notes": "",
    "type": "Feat"
  },
  "Resilient_minify": {
    "descriptionModels": [
      {
        "description": "Choose one ability score. You gain the following benefits:\n\n- Increase the chosen ability score by 1, to a maximum of 20.\n- You gain proficiency in saving throws using the chosen ability",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Resilient",
    "notes": "",
    "type": "Feat"
  },
  "Revenant Blade [EB]_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Elf\n\nYou are descended from a master of the double-bladed scimitar, and some of that mastery has passed on to you. You gain the following benefits:\n\n- Increase your Strength or Dexterity by 1, to a maximum of 20.\n\n- While you are holding a double-bladed scimitar with two hands, you gain a +1 bonus to Armor Class.\n\n- A double-bladed scimitar has the finesse property when you wield it",
        "level": 1
      }
    ],
    "id": "Custom56112b48-7ea2-44fc-9f67-56524528bb99",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Revenant Blade [EB]",
    "notes": "",
    "type": "Feat"
  },
  "Revenant Blade_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Elf\n\n- Increase your Dexterity or Strength score by 1, to a maximum of 20.\n\n- While wielding a double-bladed weapon with two hands, the weapon has the finesse trait for your attacks with it, and you gain +1 AC.\n\n- On your turn, when you use a bonus action to make a melee attack with the blade at the opposite end of the weapon, the weapon’s damage die for this attack increases to 2d4, instead of 1d4",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Revenant Blade",
    "notes": "",
    "type": "Feat"
  },
  "Ritual Caster_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Intelligence or Wisdom 13 or higher\n\nYou have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.\n\nWhen you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: bard, cleric, druid, sorcerer, warlock, or wizard. You must choose your spells from that class's spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.\n\nIf you come across a spell in written form, such as a magical spell scroll or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Ritual Caster",
    "notes": "",
    "type": "Feat"
  },
  "Savage Attacker_minify": {
    "descriptionModels": [
      {
        "description": "Once per turn when you roll damage for a melee weapon attack, you can reroll the damage dice and use either total",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Savage Attacker",
    "notes": "",
    "type": "Feat"
  },
  "Second Chance_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Halfling\n\nFortune favors you when someone tries to strike you. You gain the following benefits:\n\n- Increase your Dexterity, Constitution, or Charisma score by 1, to a maximum of 20.\n\n- When a creature you can see hits you with an attack roll, you can use your reaction to force that creature to reroll. Once you use this ability, you can't use it again until you roll initiative at the start of combat or until you finish a short or long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Second Chance",
    "notes": "",
    "type": "Feat"
  },
  "Sentinel_minify": {
    "descriptionModels": [
      {
        "description": "You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits:\n\n- When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn.\n- Creatures provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.\n- When a creature within 5 feet of you makes an attack against a target other than you (and that target doesn't have this feat), you can use your reaction to make a melee weapon attack against the attacking creature",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Sentinel",
    "notes": "",
    "type": "Feat"
  },
  "Servo Crafting_minify": {
    "descriptionModels": [
      {
        "description": "You are skilled in the creation of servos—tiny constructs that function as personal assistants. You can cast the find familiar spell as a ritual, creating a servo to serve as your familiar instead of an animal. A servo's statistics appear in the \"Artifact Creatures\" section of this document. In every other way, a servo familiar functions as described in the find familiar spell.\n\nYou can communicate telepathically with your servo familiar and perceive through its senses as long as you are on the same plane of existence. You can speak through your servo in your own voice.\n\nAdditionally, when you take the Attack action, you can forgo one of your own attacks to allow your servo familiar to make one attack of its own",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Servo Crafting",
    "notes": "",
    "type": "Feat"
  },
  "Shadow Touched [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits:\n\n- Increase your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- You learn the invisibility spell and one 1st-level spell of your choice. The 1st-level spell must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat",
        "level": 1
      }
    ],
    "id": "Custom4bfdfb91-5923-4ab6-bd3c-36bf7a32a572",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Shadow Touched [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Sharpshooter_minify": {
    "descriptionModels": [
      {
        "description": "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:\n\n- Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.\n- Your ranged weapon attacks ignore half cover and three-quarters cover.\n- Before you make an attack with a ranged weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Sharpshooter",
    "notes": "",
    "type": "Feat"
  },
  "Shield Master_minify": {
    "descriptionModels": [
      {
        "description": "You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a shield:\n\n- If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.\n- If you aren't incapacitated, you can add your shield's AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.\n- If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Shield Master",
    "notes": "",
    "type": "Feat"
  },
  "Silver-Tongued_minify": {
    "descriptionModels": [
      {
        "description": "You develop your conversational skill to better deceive others. You gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n\n- You gain proficiency in the Deception skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- When you take the Attack action on your turn, you can replace one attack with an attempt to deceive one humanoid you can see within 30 feet of you that can see and hear you. Make a Deception check contested by the target's Insight. If your check succeeds, your movement doesn't provoke opportunity attacks from the target and your attack rolls against it have advantage; both benefits last until the end of your next turn or until you use this ability on a different target. If your check fails, the target can't be deceived by you in this way for 1 hour",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Silver-Tongued",
    "notes": "",
    "type": "Feat"
  },
  "Skill Expert [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You have honed your proficiency with particular skills, granting you the following benefits:\n\n- Increase one ability score of your choice by 1, to a maximum of 20.\n\n- You gain proficiency in one skill of your choice.\n\n- Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus",
        "level": 1
      }
    ],
    "id": "Custom0f4e3d83-f358-41be-9b78-adc83c64ffa4",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Skill Expert [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Skilled_minify": {
    "descriptionModels": [
      {
        "description": "You gain proficiency in any combination of 3 skills or tools of your choice",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Skilled",
    "notes": "",
    "type": "Feat"
  },
  "Skulker_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dexterity 13 or higher\n\nYou are expert at slinking through shadows. You gain the following benefits:\n\n- You can try to hide when you are lightly obscured from the creature from which you are hiding.\n- When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.\n- Dim light doesn't impose disadvantage on your Perception checks relying on sight",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Skulker",
    "notes": "",
    "type": "Feat"
  },
  "Slasher [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You've learned where to cut to have the greatest results, granting you the following benefits:\n\n- Increase your Strength or Dexterity by 1, to a maximum of 20.\n\n- Once per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.\n\n- When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls",
        "level": 1
      }
    ],
    "id": "Custom2317e1a4-4469-464c-8f6b-292c1f6acab1",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Slasher [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Spear Mastery_minify": {
    "descriptionModels": [
      {
        "description": "Though the spear is a simple weapon to learn, it rewards you for the time you have taken to master it. You gain the following benefits.\n\n- You gain a +1 bonus to attack rolls you make with a spear.\n- When you use a spear, its damage die changes from a d6 to a d8, and from a d8 to a d10 when wielded with two hands. (This benefit has no effect if another feature has already improved the weapon's die.)\n- You can set your spear to receive a charge. As a bonus action, choose a creature you can see that is at least 20 feet away from you. If that creature moves within your spear's reach on its next turn, you can make a melee attack against it with your spear as a reaction. If the attack hits, the target takes an extra 1d8 piercing damage, or an extra 1d10 piercing damage if you wield the spear with two hands. You can't use this ability if the creature used the Disengage action before moving.\n- As a bonus action on your turn, you can increase your reach with a spear by 5 feet for the rest of your turn",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Spear Mastery",
    "notes": "",
    "type": "Feat"
  },
  "Spell Sniper_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: The ability to cast at least one spell\n\nYou have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:\n\n- When you cast a spell that requires you to make an attack roll, the spell's range is doubled.\n- Your ranged spell attacks ignore half cover and three-quarters cover.\n- You learn one cantrip that requires an attack roll. Choose the cantrip from the bard, cleric, druid, sorcerer, warlock, or wizard spell list. Your spellcasting ability for this cantrip depends on the spell list you choose from",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Spell Sniper",
    "notes": "",
    "type": "Feat"
  },
  "Squat Nimbleness_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Dwarf or a Small race\n\nYou are uncommonly nimble for your race. You gain the following benefits:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n\n- Increase your walking speed by 5 feet.\n\n- You gain proficiency in the Acrobatics or Athletics skill (your choice).\n\n- You have advantage on any Strength (Athletics) or Dexterity (Acrobatics) check you make to escape from being grappled",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Squat Nimbleness",
    "notes": "",
    "type": "Feat"
  },
  "Squire_of_Solamnia_[DSDQ]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: Fighter, Paladin, or Knight of Solamnia\n\nYour training in the ways of the Knights of Solamnia grants you these benefits:\n\n- Mount Up: Mounting or dismounting costs you only 5 feet of movement.\n\n- Precise Strike: Once per turn, when you make a weapon attack roll against a creature, you can cause the attack roll to have advantage. If the attack hits, you roll a d8 and add the number rolled as a bonus to the attack's damage roll. You can use this benefit a number of times equal to your proficiency bonus, but a use is expended only if the attack hits. You regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Custom58098920-69c8-4d9f-ad11-f23743016f81",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Squire of Solamnia [DSDQ]",
    "notes": "",
    "type": "Feat"
  },
  "Stealthy_minify": {
    "descriptionModels": [
      {
        "description": "You know how best to hide. You gain the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n\n- You gain proficiency in the Stealth skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- If you are hidden, you can move up to 10 feet in the open without revealing yourself if you end the move in a position where you're not clearly visible",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Stealthy",
    "notes": "",
    "type": "Feat"
  },
  "Strixhaven_Initiate_[SCC]_minify": {
    "descriptionModels": [
      {
        "description": "Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table.\n\nYou can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.\n\nYour spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat).\n\nStrixhaven Spells\nCollege --> Cantrips --> 1st-Level Spell\nLorehold --> Choose two from light, sacred flame, and thaumaturgy --> Choose one 1st-level cleric or wizard spell.\nPrismari --> Choose two from fire bolt, prestidigitation, and ray of frost --> Choose one 1st-level bard or sorcerer spell.\nQuandrix --> Choose two from druidcraft, guidance, and mage hand --> Choose one 1st-level druid or wizard spell.\nSilverquill --> Choose two from sacred flame, thaumaturgy, and vicious mockery --> Choose one 1st-level bard or cleric spell.\nWitherbloom --> Choose two from chill touch, druidcraft, and spare the dying --> Choose one 1st-level druid or wizard spell.",
        "level": 1
      }
    ],
    "id": "Custom114c612e-ec40-4e86-bd37-1b3c9020758f",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Strixhaven Initiate [SCC]",
    "notes": "",
    "type": "Feat"
  },
  "Strixhaven_Mascot_[SCC]_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strixhaven initiate feat\n\nYou have learned how to summon a Strixhaven mascot to assist you, granting you these benefits:\n\n- You can cast the find familiar spell as a ritual. \n\n- Your familiar can take the form of the mascot associated with the college you chose for the Strixhaven Initiate feat: a spirit statue mascot (Lorehold), an art elemental mascot (Prismari), a fractal mascot (Quandrix), an inkling mascot (Silverquill), or a pest mascot (Witherbloom).\nWhen you take the Attack action on your turn, you can forgo one attack to allow your mascot familiar to make one attack of its own with its reaction.\n\n- If your mascot familiar is within 60 feet of you, you can teleport as an action, swapping places with the familiar. If your destination space is too small for you to occupy, the teleportation fails and is wasted. Once you teleport in this way, you can't do so again until you finish a long rest, unless you expend a spell slot of 2nd level or higher to do it again",
        "level": 4
      }
    ],
    "id": "Custom97be967c-ecdf-4b16-a0dc-a826a8038ab3",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Strixhaven Mascot [SCC]",
    "notes": "",
    "type": "Feat"
  },
  "Survivalist_minify": {
    "descriptionModels": [
      {
        "description": "You master wilderness lore, gaining the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n\n- You gain proficiency in the Survival skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- You learn the Alarm spell. You can cast it once without expending a spell slot, and you regain the ability to do so when you finish a long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Survivalist",
    "notes": "",
    "type": "Feat"
  },
  "Svirfneblin Magic_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Gnome (deep gnome)\n\nYou have inherited the innate spellcasting ability of your ancestors. This ability allows you to cast Nondetection on yourself at will, without needing a material component. You can also cast each of the following spells once with this ability: \n\nBlindness/Deafness, Blur, and Disguise Self. You regain the ability to cast these spells when you finish a long rest. Intelligence is your spellcasting ability for these spells, and you cast them at their lowest possible levels",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Svirfneblin Magic",
    "notes": "",
    "type": "Feat"
  },
  "Tavern Brawler_minify": {
    "descriptionModels": [
      {
        "description": "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:\n\n- Increase your Strength or Constitution score by 1, to a maximum of 20.\n- You are proficient with improvised weapons and unarmed strikes.\n- Your unarmed strikes use a d4 for damage.\n- When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target. A grapple check is a Strength (Athletics) check contested by the target's Strength (Athletics) or Dexterity (Acrobatics) check",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Tavern Brawler",
    "notes": "",
    "type": "Feat"
  },
  "Telekinetic [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You learn to move things with your mind, granting you the following benefits:\n\n- Increase your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- You learn the mage hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.\n\n- As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save",
        "level": 1
      }
    ],
    "id": "Custome9b70627-806b-4b58-bbd3-9664ac220e1d",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Telekinetic [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Telepathic [TCE]_minify": {
    "descriptionModels": [
      {
        "description": "You awaken the ability to mentally connect with others, granting you the following benefits:\n\n- Increase your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.\n\n- You can cast the detect thoughts spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. Your spellcasting ability for the spell is the ability increased by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them",
        "level": 1
      }
    ],
    "id": "Custom5cebaf6c-cfbc-461e-800c-eb284c070a05",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Telepathic [TCE]",
    "notes": "",
    "type": "Feat"
  },
  "Theologian_minify": {
    "descriptionModels": [
      {
        "description": "Your extensive study of religion rewards you with the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n\n- You gain proficiency in the Religion skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n\n- You learn the Thaumaturgy cantrip and Detect Evil and Good spells. You can cast Detect Evil and Good once without expending a spell slot, and you regain the ability to do so when you finish a long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Theologian",
    "notes": "",
    "type": "Feat"
  },
  "Tough_minify": {
    "descriptionModels": [
      {
        "description": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Tough",
    "notes": "",
    "type": "Feat"
  },
  "Vampiric Exultation_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Vampire (Ixalan)\n\nAs an action, you transform the lower half of your body into a black vapor. You can float in the air and have a flying speed of 30 feet. This effect lasts for up to 10 minutes. Once you use this ability, you can’t use it again until you finish a short or long rest",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Vampiric Exultation",
    "notes": "",
    "type": "Feat"
  },
  "War Caster_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: The ability to cast at least one spell\n\nYou have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\n\n- You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.\n- You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.\n- When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "War Caster",
    "notes": "",
    "type": "Feat"
  },
  "Weapon Master_minify": {
    "descriptionModels": [
      {
        "description": "You have practiced extensively with a variety of weapons, gaining the following benefits:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- You gain proficiency with four simple or martial weapons of your choice",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Weapon Master",
    "notes": "",
    "type": "Feat"
  },
  "Wonder Maker_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Gnome (rock)\n\nYou master the tinker techniques of your people. You gain the following benefits:\n\n- Increase your Dexterity or Intelligence score by 1, to a maximum of 20.\n\n- When you make a check using your proficiency with tinker's tools, you add double your proficiency bonus to the check.\n\n- When you make a device with your Tinker trait, you have the following additional options for what you make:\n    - Alarm: This device senses when a creature moves to within 15 feet of it without speaking aloud a password chosen when you create it. One round after a creature moves into range, the alarm makes a shrill ringing that lasts for 1 minute and can be heard from up to 300 feet away.\n    - Calculator: This device makes doing sums easy.\n    - Lifter: This device can be used as a block and tackle, allowing its user to hoist five times the weight the user can normally lift.\n    - Timekeeper: This pocket watch keeps accurate time.\n    - Weather Sensor: When used as an action, this device predicts weather conditions in a 1-mile radius over the next 4 hours, showing one symbol (clouds, sun/moon, rain, or snow) for each hour",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Wonder Maker",
    "notes": "",
    "type": "Feat"
  },
  "Wood Elf Magic_minify": {
    "descriptionModels": [
      {
        "description": "Prerequisite: Elf (wood)\n\nYou learn the magic of the primeval woods, which are revered and protected by your people. You learn one druid cantrip of your choice. You also learn the longstrider and Pass without Trace spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells",
        "level": 1
      }
    ],
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Wood Elf Magic",
    "notes": "",
    "type": "Feat"
  },
  "feat_Agent_of_Order_[SatO]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, scion of the outer planes (lawful outer plane) feat\n\nYou can channel cosmic forces of order to gain these benefits:\n\n- Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 20.\n\n- Stasis Strike: Once per turn, when you damage a creature you can see within 60 feet of yourself, you can deal an extra 1d8 force damage to the target, and it must make a Wisdom saving throw (DC equal to 8 + your proficiency bonus + the modifier of the spellcasting ability you chose for the Scion of the Outer Planes feat) as spectral bindings try to ensnare it. On a successful save, the target escapes. On a failed save, the target has the restrained condition until the start of your next turn. These bindings manifest as chains or some other symbol of stasis. You can use this benefit a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custombd221aa7-a711-4315-9946-4c81df074105",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Agent of Order [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Baleful_Scion_[SatO]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, scion of the outer planes (evil outer plane) feat\n\nYou can channel cosmic forces of evil to gain these benefits:\n\n- Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 20.\n\n- Grasp of Avarice: Once per turn, when you damage a creature you can see within 60 feet of yourself, you can also deal necrotic damage to it. The necrotic damage equals 1d6 + your proficiency bonus, and you regain a number of hit points equal to this necrotic damage dealt. You can use this benefit a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Customa0a99848-cf96-458e-a9ff-b338c5a37eb3",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Baleful Scion [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Cartomancer_[BMT]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, Spellcasting Feature\n\nYou have learned to channel your magic through a deck of cards. You can use a card deck as your spellcasting focus, and you gain the following benefits:\n\n- Card Tricks: You learn the Prestidigitation cantrip and can use it to create illusions that duplicate the effects of stage magic. When you use Prestidigitation in this way, you can conceal the verbal and somatic components of the spell as ordinary conversation and card handling.\n\n- Hidden Ace: When you finish a long rest, you can choose one spell from your class's spell list and imbue that spell into a card. The chosen spell must have a casting time of 1 action, and it must be a level for which you have spell slots. The card remains imbued with this spell for 8 hours. While the card is imbued with the spell, you can use a bonus action to flourish the card and cast the spell within. The card then immediately loses its magic",
        "level": 4
      }
    ],
    "id": "Custombbbe2d78-abf0-4c91-b697-1e35a02c7cdc",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Cartomancer [BMT]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Cohort_of_Chaos_[SatO]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, scion of the outer planes (chaotic outer plane) feat\n\nYou can channel cosmic forces of chaos to gain these benefits:\n\n- Increase one ability score of your choice by 1, to a maximum of 20.\n\n- Chaotic Flare: When you roll a 1 or a 20 on an attack roll or a saving throw, the magic of chaos flows through you. Roll a d4 and consult the Chaotic Flares table to determine what happens. A flare lasts until the end of your next turn, and a new flare can't occur until after the first flare ends.\n\nChaotic Flares\nd4 --> Flare\n1 --> Battle Fury. A creature of your choice that you can see is filled with reckless fury. It has advantage on attack rolls and disadvantage on ability checks.\n2 --> Disruption Field. Waves of energy ripple around you. Every creature that starts its turn within 5 feet of you, or that moves into that area for the first time on a turn, takes 1d8 force damage.\n3 --> Unbound. When you move, you can use some or all of your walking speed to teleport yourself once, along with any equipment you're wearing or carrying, up to the distance used to an unoccupied space that you can see.\n4 --> Wailing Winds. Winds swirl in a 15-foot-radius sphere centered on you. You and any other creatures in that area have disadvantage on Wisdom saving throws",
        "level": 4
      }
    ],
    "id": "Customad70948b-73cd-4693-b102-ec84f54c0d82",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Cohort of Chaos [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Ember_of_the_Fire_Giant_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strike of the giants (fire strike) feat\n\nYou've manifested the fiery combat emblematic of fire giants, granting you the following benefits:\n\n- Ability Score Increase: Increase your Strength, Constitution, or Wisdom by 1, to a maximum of 20.\n\n- Born of Flame: You have resistance to fire damage.\n\n- Searing Ignition: When you take the Attack action on your turn, you can replace a single attack with a magical burst of flame. Each creature of your choice in a 15-foot-radius sphere centered on you must make a Dexterity saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat). On a failed save, a creature takes fire damage equal to 1d8 + your proficiency bonus, and it has the blinded condition until the start of your next turn. On a successful save, the creature takes half as much damage only. You can use your Searing Ignition a number of times equal to your proficiency bonus (but no more than once per turn), and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom1b6cd6ed-9803-44e9-a2e4-9f6936f0fef7",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Ember of the Fire Giant [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Fury_of_the_Frost_Giant_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strike of the giants (frost strike) feat\n\nYou've manifested the icy might emblematic of frost giants, granting you the following benefits:\n\n- Ability Score Increase: Increase your Strength, Constitution, or Wisdom by 1, to a maximum of 20.\n\n- Born of Ice: You have resistance to cold damage.\n\n- Frigid Retaliation: Immediately after a creature you can see within 30 feet of you hits you with an attack roll and deals damage, you can use your reaction to retaliate with a conjured blast of ice. The creature must make a Constitution saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat). On a failed save, the creature takes cold damage equal to 1d8 + your proficiency bonus, and its speed is reduced to 0 until the end of its next turn. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom34c44496-389b-4f9d-9924-8027e0567ce4",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Fury of the Frost Giant [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Guile_of_the_Cloud_Giant_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strike of the giants (cloud strike) feat\n\nYou've manifested the confounding magic emblematic of cloud giants, granting you the following benefits:\n\n- Ability Score Increase: Increase your Strength, Constitution, or Charisma by 1, to a maximum of 20.\n\n- Cloudy Escape: When a creature you can see hits you with an attack roll, you can use your reaction to give yourself resistance to that attack's damage. You then teleport to an unoccupied space that you can see within 30 feet of yourself. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Customace2a722-c909-4db4-abc9-fab65670dcd2",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Guile of the Cloud Giant [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Keenness_of_the_Stone_Giant_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strike of the giants (stone strike) feat\n\nYou've manifested the physical talents emblematic of stone giants, granting you the following benefits:\n\n- Ability Score Increase: Increase your Strength, Constitution, or Wisdom by 1, to a maximum of 20.\n\n- Cavernous Sight: You gain darkvision with a range of 60 feet. If you already have darkvision from another source, its range increases by 60 feet.\n\n- Stone Throw: As a bonus action, you can take a rock and make a magical attack with it. The attack is a ranged spell attack with a range of 60 feet that uses the ability score you increased with this feat as the spellcasting ability. On a hit, the rock deals 1d10 force damage, and the target must succeed on a Strength saving throw (DC equals 8 + your proficiency bonus + the spellcasting ability modifier) or have the prone condition. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom8788522f-c29c-439d-88b4-6a32c6a80a47",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Keenness of the Stone Giant [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Outlands_Envoy_[SatO]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, scion of the outer planes (the outlands) feat\n\nYou have spent significant time in Sigil or the Outlands, the crossroads of the multiverse. Being steeped in converging planar energies grants you these benefits:\n\n- Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 20.\n\n- Crossroads Emissary: You learn the misty step and tongues spells. You can cast each spell once using this feat without a spell slot, and you must finish a long rest before you can cast that spell in this way again. When you cast tongues using this feat, you require no material components. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the one chosen when you gained the Scion of the Outer Planes feat",
        "level": 4
      }
    ],
    "id": "Customa747d2de-6dcd-4776-b5b4-200c1f3979cb",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Outlands Envoy [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Planar_Wanderer_[SatO]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, scion of the outer planes feat\n\nYou can draw on the forces of the multiverse to survive cosmic extremes and to traverse its infinite realms, granting you these benefits:\n\n- Planar Adaptation: When you finish a long rest, you gain resistance to either acid, cold, or fire damage (your choice) until you finish your next long rest.\n\n- Portal Cracker: Your experience with portals allows you to open them without a portal key. As an action, you can concentrate on a portal you're aware of that is within 5 feet of yourself and make a DC 20 Intelligence (Arcana) check. On a failed check, you take 3d8 psychic damage and can't use this benefit on that portal again until you finish a long rest. On a successful check, you can force the portal open or closed for 1 hour. For that duration, the portal doesn't respond to its portal key unless a creature employing the key succeeds on a DC 20 Intelligence (Arcana) check as an action.\n\n- Portal Sense: You know the direction to the last planar portal you used while you and the portal are on the same plane of existence. Moreover, as an action, you can detect the location of any portals within 30 feet of you that aren't behind total cover. Once you detect a portal with this action, you can't use the action again until you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom41cf57eb-5948-4850-b0d9-889fa13e06a4",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Planar Wanderer [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Righteous_Heritor_[SatO]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, scion of the outer planes (good outer plane) feat\n\nYou can channel cosmic forces of good to gain these benefits:\n\n- Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 20.\n\n- Soothe Pain: When you or a creature within 30 feet of you takes damage, you can use your reaction to reduce that damage by 1d10 + your proficiency bonus. You can use this benefit a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Custom1d03d24c-db60-43e5-97ca-652b81e134dd",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Righteous Heritor [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Rune_Shaper_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: Spellcasting Feature or Rune Carver\n\nYou've studied the magic of Giant runes, granting you the following benefits:\n\n- Comprehend Languages: You learn the comprehend languages spell. You can cast this spell without expending a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast this spell using any spell slots you have.\n\n- Rune Magic: You know a number of runes equal to half your proficiency bonus (rounded down), chosen from the Rune Spells table. Whenever you finish a long rest, you can inscribe each rune you know onto one nonmagical weapon, armor, piece of clothing, or other object you touch. You temporarily learn the 1st-level spells that correspond to the runes you inscribed, as specified on the Rune Spells table, and you know those spells until you finish a long rest, when the runes fade. While you are wearing or carrying any rune-marked object, you can cast the spells associated with those runes using any spell slots you have.\nYou can also invoke a rune inscribed on an object you are wearing or carrying and cast its associated spell without expending a spell slot or using material components. Once you cast the spell in this way, you can't do so again until you finish a long rest. Your spellcasting ability for this feat is Intelligence, Wisdom, or Charisma (choose when you select this feat).\nEach time you gain a level, you can replace one of the runes you know with another one from the Rune Spells table.\n\nRune --> Spell\nCloud --> Fog cloud\nDeath --> Inflict wounds\nDragon --> Chromatic orb\nEnemy --> Disguise self\nFire --> Burning hands\nFriend --> Speak with animals\nFrost --> Armor of Agathys\nHill --> Goodberry\nJourney --> Longstrider\nKing --> Command\nMountain --> Entangle\nStone --> Sanctuary\nStorm --> Thunderwave",
        "level": 1
      }
    ],
    "id": "Customd65e9504-6360-4d69-94a7-383ef1d6a957",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Rune Shaper [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Scion_of_the_Outer_Planes_[SatO]": {
    "descriptionModels": [
      {
        "description": "Your connection to an Outer Plane infuses you with the energy there. Choose a type of plane listed in the Planar Infusion table. Your choice gives you resistance to a damage type and the ability to cast a cantrip, as specified in the table. You can cast this cantrip without material components, and your spellcasting ability for it is Intelligence, Wisdom, or Charisma (choose when you select this feat).\n\nPlane --> Damage Resistance --> Cantrip\nChaotic Outer Plane --> Poison --> Minor illusion\nEvil Outer Plane --> Necrotic --> Chill touch\nGood Outer Plane --> Radiant --> Sacred flame\nLawful Outer Plane --> Force --> Guidance\nThe Outlands --> Psychic --> Mage Hand",
        "level": 1
      }
    ],
    "id": "Customf811fc3e-c17b-4801-8c9e-e6721934c172",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Scion of the Outer Planes [SatO]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Soul_of_the_Storm_Giant_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strike of the giants (storm strike) feat\n\nYou've manifested the tempest magic emblematic of storm giants, granting you the following benefits:\n\n- Ability Score Increase: Increase your Strength, Wisdom, or Charisma by 1, to a maximum of 20.\n\n- Maelstrom Aura: As a bonus action, you surround yourself with an aura of magical wind and lightning that extends 10 feet from you in every direction but not through total cover. The aura lasts until the start of your next turn or until you are incapacitated. While the aura is active, you have resistance to lightning and thunder damage. In addition, attack rolls against you have disadvantage, and whenever another creature starts its turn within the aura, you can force the creature to make a Strength saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat). On a failed save, the creature's speed is halved until the start of its next turn. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 4
      }
    ],
    "id": "Customa50b1f3d-978b-4e30-b887-80f56f75e860",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Soul of the Storm Giant [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Strike_of_the_Giants_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: Martial Proficiency or Giant Foundling\n\nYou have absorbed primeval magic that gives you an echo of the might of giants. When you take this feat, choose one of the benefits listed below. Once per turn, when you hit a target with a melee weapon attack or a ranged weapon attack using a thrown weapon, you can imbue the attack with an additional effect depending on the benefit you chose:\n\n- Cloud Strike: The target takes an extra 1d4 thunder damage. If the target is a creature, it must succeed on a Wisdom saving throw, or you become invisible to it until the start of your next turn or until immediately after you make an attack roll or cast a spell.\n\n- Fire Strike: The target takes an extra 1d10 fire damage.\n\n- Frost Strike: The target takes an extra 1d6 cold damage. If the target is a creature, it must succeed on a Constitution saving throw, or its speed is reduced to 0 until the start of your next turn.\n\n- Hill Strike: The target takes an extra 1d6 damage of the weapon's type. If the target is a creature, it must succeed on a Strength saving throw or have the prone condition.\n\n- Stone Strike: The target takes an extra 1d6 force damage. If the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet from you in a straight line\n\n- Storm Strike: The target takes an extra 1d6 lightning damage. If the target is a creature, it must succeed on a Constitution saving throw, or it has disadvantage on attack rolls until the start of your next turn.\nThe saving throw DC for these effects equals 8 + your proficiency bonus + your Strength or Constitution modifier.\n\nYou can use this feat a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest",
        "level": 1
      }
    ],
    "id": "Custom14ecfe47-698a-4a10-bcf3-ce66d0927ffe",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Strike of the Giants [BGG]",
    "notes": "",
    "type": "Feat"
  },
  "feat_Vigor_of_the_Hill_Giant_[BGG]": {
    "descriptionModels": [
      {
        "description": "Prerequisites: 4th level, strike of the giants (hill strike) feat\n\nYou've manifested the resilience emblematic of hill giants, granting you the following benefits:\nAbility Score Increase. Increase your Strength, Constitution, or Wisdom by 1, to a maximum of 20.\n\nBulwark. When you are subjected to an effect that would move you at least 5 feet or give you the prone condition, you can use your reaction to steady yourself. You aren't moved and don't have the prone condition.\n\nIron Stomach. Whenever you eat food as part of a short rest and spend one or more Hit Dice to regain hit points, you regain additional hit points equal to your Constitution modifier + your proficiency bonus",
        "level": 4
      }
    ],
    "id": "Custom90639136-ad48-4011-b74f-a5b8b1ff3ede",
    "isFeature": false,
    "jsonType": "feat",
    "level": 1,
    "name": "Vigor of the Hill Giant [BGG]",
    "notes": "",
    "type": "Feat"
  }
}