{"ac":17,"actions":[{"description":"The alkilith makes three Tentacle attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"8 to hit, reach 15 ft., one target. Hit: 18 (4d6 + 4) acid damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Tentacle","type":"MELEE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":7,"climbSpeed":40,"con":22,"conditionImmunities":"charmed, frightened, poisoned","cr":"11","damageImmunities":"poison","dex":19,"flySpeed":0,"hp":{"constant":96,"diceAmount":16,"diceType":"D8"},"id":-1,"int":6,"isLocked":true,"jsonType":"monster","languages":"understands Abyssal but can't speak","name":"Alkilith [MoM]","resistances":"acid, cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Dex +8, Con +10","senses":"darkvision 120 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"If the alkilith surrounds a door, window, or similar opening continuously for 6d6 days, the opening becomes a permanent portal to a random layer of the Abyss.","id":-1,"monsterId":-1,"name":"Abyssal Rift"},{"description":"The alkilith can move through a space as narrow as 1 inch wide without squeezing.","id":-1,"monsterId":-1,"name":"Amorphous"},{"description":"If the alkilith is motionless at the start of combat, it has advantage on its initiative roll. Moreover, if a creature hasn't observed the alkilith move or act, that creature must succeed on a DC 18 Intelligence (Investigation) check to discern that the alkilith isn't ordinary slime or fungus.","id":-1,"monsterId":-1,"name":"False Appearance"},{"description":"Any creature that isn't a demon that starts its turn within 30 feet of the alkilith must succeed on a DC 18 Wisdom saving throw, or it hears a faint buzzing in its head for a moment and has disadvantage on its next attack roll, saving throw, or ability check.\n\nIf the saving throw against Foment Confusion fails by 5 or more, the creature is instead subjected to the confusion spell for 1 minute (no concentration required by the alkilith). While under the effect of that confusion, the creature is immune to Foment Confusion.","id":-1,"monsterId":-1,"name":"Foment Confusion"},{"description":"The alkilith has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"The alkilith can climb difficult surfaces, such as upside down on ceilings, without making an ability check.","id":-1,"monsterId":-1,"name":"Spider Climb"},{"description":"The alkilith doesn't require air, food, drink, or sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":40,"str":12,"swimSpeed":0,"tag":"demon","type":"Fiend","vulnerabilities":null,"wis":11,"xp":7200}