{"ac":17,"actions":[{"description":"The staff has 10 charges. It can expend 1 or more of its charges to cast one of the following spells (save DC 12): cone of cold (5 charges), fog cloud (1 charge), ice storm (4 charges), or wall of ice (4 charges). It regains 1d6 + 4 expended charges daily at dawn. If the staff expends its last charge, roll a d20. On a 1, the staff turns to water and is destroyed.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Staff of Frost","type":"NONE"},{"description":" 5 to hit, reach 5 ft., one target. Hit: 7 (2d6) bludgeoning damage plus 1 cold damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Staff","type":"MELEE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":10,"climbSpeed":0,"con":10,"conditionImmunities":null,"cr":"0","damageImmunities":"poison","dex":12,"flySpeed":30,"hp":{"constant":40},"id":-1,"int":18,"isLocked":true,"jsonType":"monster","languages":"Common","name":"Animated Staff","resistances":"cold","savingThrows":null,"senses":"blindsight 60 ft. (blind beyond this radius)","size":"Medium","skills":null,"specialTraits":[{"description":"A creature can grab the staff out of the air with a successful grapple check against the staff, and grappling the staff does not reduce the creature's speed. Any creature that successfully grapples the staff must succeed on a DC 12 Charisma saving throw or be charmed by the staff until the staff is no longer in its grasp. While the creature is charmed, the staff can issue commands to it, which the creature does its best to obey. The creature can repeat the saving throw each time it takes damage, ending the effect on itself on a success. A creature that successfully resists the staff's control can't be charmed by it for 24 hours.\n\nA creature holding the staff that isn't charmed by it can use an action to attempt to break the staff over a knee or against a solid surface, doing so with a successful DC 17 Strength (Athletics) check. Breaking the staff in this manner destroys it.","id":-1,"monsterId":-1,"name":"Wielder Domination"}],"speed":0,"str":12,"swimSpeed":0,"tag":null,"type":"Construct","vulnerabilities":null,"wis":14,"xp":10}