{"ac":16,"actions":[{"description":"The plant makes three Vine Lash attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":" 7 to hit, reach 20 ft., one target. Hit: 11 (2d6 + 4) slashing damage. If the target is a creature, it is grappled (escape DC 15). Until the grapple ends, the target is restrained. The plant has four vines, each of which can grapple one target.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Vine Lash","type":"MELEE"},{"description":" 7 to hit, reach 5 ft., one Medium or smaller creature grappled by the plant. Hit: 22 (4d8 + 4) acid damage, and the target is pulled into the plant's space and enveloped by the pod, and the grapple ends. While enveloped, the target is restrained, and it has total cover against attacks and effects originating outside the pod. The enveloped target must also immediately succeed on a DC 16 Constitution saving throw or be stunned by the plant's sapping enzymes until it is removed from the pod or the plant dies. The enveloped target doesn't require air and gains 1 level of exhaustion for each hour it spends in the pod. If the target dies while enveloped, it immediately emerges from the pod as a living podling, wearing or carrying all of the original creature's equipment.\n\nAs an action, a creature within 5 feet of the bodytaker plant that is outside the pod can open the pod and pull the target free with a successful DC 15 Strength check. If the plant dies, the target is no longer restrained and can escape from the pod by spending 10 feet of movement, exiting prone. The plant has one pod, which can envelop one creature at a time.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Entrapping Pod","type":"MELEE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":18,"climbSpeed":10,"con":20,"conditionImmunities":"blinded, charmed, frightened, prone","cr":"7","damageImmunities":null,"dex":8,"flySpeed":0,"hp":{"constant":40,"diceAmount":8,"diceType":"D12"},"id":-1,"int":14,"isLocked":true,"jsonType":"monster","languages":"Deep Speech, telepathy 120 ft.","name":"Bodytaker Plant","resistances":null,"savingThrows":null,"senses":"blindsight 120 ft. (blind beyond this radius)","size":"Huge","skills":null,"specialTraits":[{"description":"The plant can see through and communicate telepathically with any of its podlings within 10 miles of it.","id":-1,"monsterId":-1,"name":"Podling Link"},{"description":"When the plant dies, it returns to life in the place where it died 1d12 months later, unless the ground where it took root is sown with salt or soaked with poison.","id":-1,"monsterId":-1,"name":"Rejuvenation"},{"description":"The plant doesn't require sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":10,"str":18,"swimSpeed":10,"tag":null,"type":"Plant","vulnerabilities":"poison","wis":14,"xp":2900}