{"ac":15,"actions":[{"description":"The giant makes three Flying Staff attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"14 to hit, reach 10 ft. or range 30/90 ft., one target. Hit: 18 (3d6 + 8) bludgeoning damage plus 16 (3d10) thunder damage. Hit or Miss: The staff magically returns to the giant's hand immediately after a ranged attack.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Flying Staff","type":"MELEE_OR_RANGED"},{"description":"The giant magically summons a thundercloud that fills a 30-foot-radius sphere centered on a point the giant can see within 60 feet of itself. The cloud spreads around corners. Each creature in that area must make a DC 20 Constitution saving throw as the cloud emits a thunderous boom. On a failed save, a creature takes 52 (8d12) thunder damage and has the prone condition. On a successful save, a creature takes half as much damage only. The thunderclap is audible within 300 feet of the cloud's center point.\n\nThe cloud's area is heavily obscured. The cloud lingers until the start of the giant's next turn or until a strong wind disperses it.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Thunderous Clap (Requires Cloud Rune)","type":"NONE"},{"description":"The giant casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 20):\nAt will: detect magic, fog cloud, light, minor illusion\n\n1/day each: dream (as an action), gaseous form, major image","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":22,"climbSpeed":0,"con":22,"conditionImmunities":null,"cr":"19","damageImmunities":"thunder","dex":12,"flySpeed":40,"hp":{"constant":162,"diceAmount":27,"diceType":"D12"},"id":-1,"int":19,"isLocked":true,"jsonType":"monster","languages":"Common, Giant","name":"Cloud Giant Destiny Gambler [BGG]","resistances":null,"savingThrows":"Con +12, Int +10, Wis +9, Cha +12","senses":"truesight 30 ft. (requires cloud rune)","size":"Huge","skills":null,"specialTraits":[{"description":"The giant has a cloud rune inscribed on a mask in its possession. While holding or wearing the mask bearing the rune, the giant has truesight within a range of 30 feet and can use its Thunderous Clap action and Negate Spell reaction.\n\nThe mask bearing the cloud rune has AC 15; 45 hit points; and immunity to necrotic, poison, and psychic damage. The mask regains all its hit points at the end of every turn, but it turns to dust if reduced to 0 hit points or when the giant dies. If the rune is destroyed, the giant can inscribe a cloud rune on a mask in its possession when it finishes a short or long rest.","id":-1,"monsterId":-1,"name":"Cloud Rune"}],"speed":40,"str":27,"swimSpeed":0,"tag":"bard","type":"Giant","vulnerabilities":null,"wis":16,"xp":22000}