{"ac":19,"actions":[{"description":"The cradle makes three Slam or Spit Rock attacks in any combination and one Grasping Root attack.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"14 to hit, reach 20 ft., one target. Hit: 33 (4d12 + 7) bludgeoning damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Slam","type":"MELEE"},{"description":"14 to hit, range 120 ft., one target. Hit: 25 (4d8 + 7) bludgeoning damage, and the target must succeed on a DC 22 Strength saving throw or have the prone condition.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spit Rock","type":"RANGED"},{"description":"14 to hit, reach 30 ft., one creature not grappled by the cradle. Hit: the target has the grappled condition (escape DC 17). Until the grapple ends, the target takes 29 (4d10 + 7) bludgeoning damage at the start of each of its turns. The root has AC 19 and can be severed by dealing 15 or more slashing damage to it on one attack. Cutting the root doesn't hurt the cradle but ends the grapple.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Grasping Root","type":"MELEE"},{"description":"The cradle magically creates a wave of dirt that extends from a point on the ground within 120 feet of itself. The wave is up to 30 feet long, up to 30 feet tall, and up to 30 feet wide. Each creature in the wave must make a DC 22 Strength saving throw. On a failed save, a creature takes 58 (9d12) bludgeoning damage, has the prone condition, and is buried under dirt. On a successful save, a creature takes half as much damage only.\n\nA buried creature has the restrained condition, has total cover, and can't breathe. As an action, a creature buried in this way, or another creature within 5 feet of it that isn't buried, can make a DC 17 Strength (Athletics) check. On a successful check, the buried creature no longer has the prone or restrained conditions.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Rolling Hills (Recharge 6)","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":10,"climbSpeed":0,"con":24,"conditionImmunities":"exhaustion, paralyzed, petrified, poisoned, prone","cr":"22","damageImmunities":"poison","dex":10,"flySpeed":0,"hp":{"constant":161,"diceAmount":23,"diceType":"D20"},"id":-1,"int":9,"isLocked":true,"jsonType":"monster","languages":"Giant, Primordial","name":"Cradle of the Hill Scion [BGG]","resistances":"cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Wis +10, Cha +7","senses":null,"size":"Gargantuan","skills":null,"specialTraits":[{"description":"The cradle is a container for the scion of Grolantor|BGG. When the cradle drops to 0 hit points, its body crumbles to dirt and moss. The scion instantly appears in the space the cradle occupied and uses the cradle's initiative count.","id":-1,"monsterId":-1,"name":"Awakening of the Scion"},{"description":"If the cradle fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (5/Day)"},{"description":"The cradle has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"The cradle deals double damage to objects and structures.","id":-1,"monsterId":-1,"name":"Siege Monster"}],"speed":40,"str":25,"swimSpeed":0,"tag":null,"type":"Elemental","vulnerabilities":null,"wis":16,"xp":41000}