{"ac":19,"actions":[{"description":"The cradle makes three Slam or Wind Javelin attacks in any combination.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"17 to hit, reach 20 ft., one target. Hit: 31 (4d10 + 9) bludgeoning damage plus 19 (3d12) thunder damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Slam","type":"MELEE"},{"description":"17 to hit, range 120 ft., one target. Hit: 27 (4d8 + 9) bludgeoning damage plus 10 (3d6) thunder damage, and the target must succeed on a DC 25 Strength saving throw or have the prone condition.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Wind Javelin","type":"RANGED"},{"description":"The cradle conjures a vortex of wind at a point it can see within 90 feet of itself. The wind vortex is a 30-foot-radius, 100-foot-high cylinder centered on that point. Each creature other than the cradle in that area must make a DC 25 Dexterity saving throw. On a failed save, a creature takes 71 (11d12) bludgeoning damage and has the restrained condition within the vortex. On a successful save, a creature takes half as much damage and is pushed to the nearest unoccupied space outside the cylinder. The vortex lasts until the start of the cradle's next turn. A creature with the restrained condition falls prone when the vortex ends.\n\nA creature with the restrained condition can use its action to try to escape the vortex. The creature makes a DC 19 Strength (Athletics) or Dexterity (Acrobatics) check. On a successful check, the creature escapes and moves 3d6 × 10 feet away from the vortex in a random direction.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Vortex (Recharge 5-6)","type":"NONE"}],"alignment":"Chaotic Neutral","burrowSpeed":0,"cha":19,"climbSpeed":0,"con":28,"conditionImmunities":"exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned","cr":"26","damageImmunities":"poison, thunder","dex":21,"flySpeed":90,"hp":{"constant":288,"diceAmount":32,"diceType":"D20"},"id":-1,"int":14,"isLocked":true,"jsonType":"monster","languages":"Giant, Primordial","name":"Cradle of the Cloud Scion [BGG]","resistances":"cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Int +10, Cha +12","senses":null,"size":"Gargantuan","skills":null,"specialTraits":[{"description":"The cradle is a container for the scion of Memnor|BGG. When the cradle drops to 0 hit points, its body dissipates into cloud wisps. The scion instantly appears in the space the cradle occupied and uses the cradle's initiative count.","id":-1,"monsterId":-1,"name":"Awakening of the Scion"},{"description":"The cradle doesn't provoke opportunity attacks when it flies out of an enemy's reach.","id":-1,"monsterId":-1,"name":"Flyby"},{"description":"If the cradle fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (5/Day)"},{"description":"The cradle has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"The cradle deals double damage to objects and structures.","id":-1,"monsterId":-1,"name":"Siege Monster"}],"speed":0,"str":29,"swimSpeed":0,"tag":null,"type":"Elemental","vulnerabilities":null,"wis":22,"xp":90000}