{"ac":17,"actions":[{"description":"The titan makes two Agonizing Burst attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"{@atk ms,rs} 12 to hit, reach 15 ft. or range 120 ft., one target. Hit: 17 (3d6 + 7) force damage. If the target is a creature, the titan regains 5 hit points.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Agonizing Burst","type":"NONE"},{"description":"The titan teleports to an unoccupied space it can see within 120 feet of itself.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Teleport","type":"NONE"},{"description":"The titan makes one Agonizing Burst attack.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Attack","type":"NONE"},{"description":"The titan uses Teleport, after which it can target one creature within 20 feet of itself that it can see. The target must make a DC 20 Constitution saving throw. On a failed save, the target takes 22 (4d10) necrotic damage, and the titan regains 10 hit points. On a successful save, the target takes half as much damage, and the titan doesn't heal.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Stalking Nightmare (Costs 2 Actions)","type":"NONE"},{"description":"The titan targets one creature it can see within 120 feet of itself. The target must make a DC 20 Wisdom saving throw. On a failed save, the target takes 38 (7d10) psychic damage and is frightened of the titan until the end of the target's next turn, and the titan regains 15 hit points. On a successful save, the target takes half as much damage and isn't frightened, and the titan doesn't heal.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Terrorize (Costs 3 Actions)","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":20,"climbSpeed":0,"con":26,"conditionImmunities":"charmed, frightened","cr":"16","damageImmunities":"psychic","dex":10,"flySpeed":0,"hp":{"constant":88,"diceAmount":11,"diceType":"D20"},"id":-1,"int":24,"isLocked":true,"jsonType":"monster","languages":"Abyssal, Infernal, telepathy 120 ft.","name":"Daemogoth Titan","resistances":null,"savingThrows":"Int +12, Wis +9, Cha +10","senses":"truesight 120 ft.","size":"Gargantuan","skills":null,"specialTraits":[{"description":"If the titan fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"},{"description":"Using a 10-minute long ritual, the titan can forge a magical bond with a willing creature it touches throughout the ritual. The creature becomes bound by the pact until it dies, the titan dies, or the pact is broken by a wish spell.\n\nThe titan chooses one spell from the necromancy or enchantment school that is 8th level or lower. The bound creature can cast that spell using this pact, requiring no material components and using Intelligence as the spellcasting ability. When it casts the spell, the creature takes 21 (6d6) psychic damage, which can't break the creature's concentration on a spell. Once the bound creature casts the spell in this way, it can't do so again until it finishes a long rest.","id":-1,"monsterId":-1,"name":"Pact of Suffering"}],"speed":40,"str":26,"swimSpeed":0,"tag":null,"type":"Fiend","vulnerabilities":null,"wis":18,"xp":15000}