{"ac":16,"actions":[{"description":"The daemogoth makes three Agonizing Burst attacks. It can use Terrify, if available, in place of one of the attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"{@atk ms,rs} 9 to hit, reach 10 ft. or range 120 ft., one target. Hit: 11 (2d10) force damage. If the target is a creature, the daemogoth regains 5 hit points.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Agonizing Burst","type":"NONE"},{"description":"The daemogoth targets one creature it can see within 120 feet of itself. The target must make a DC 17 Wisdom saving throw. On a failed save, the target takes 33 (6d10) psychic damage and is frightened of the daemogoth until the end of the daemogoth's next turn, and the daemogoth regains 5 hit points. On a successful save, the target takes half as much damage and isn't frightened, and the daemogoth doesn't heal.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Terrify (Recharge 4-6)","type":"NONE"}],"alignment":"Lawful Evil","burrowSpeed":0,"cha":18,"climbSpeed":40,"con":19,"conditionImmunities":"frightened","cr":"10","damageImmunities":"psychic","dex":15,"flySpeed":0,"hp":{"constant":60,"diceAmount":15,"diceType":"D12"},"id":-1,"int":21,"isLocked":true,"jsonType":"monster","languages":"Abyssal, Infernal, telepathy 120 ft.","name":"Daemogoth","resistances":null,"savingThrows":"Int +9, Wis +6, Cha +8","senses":"truesight 120 ft.","size":"Huge","skills":null,"specialTraits":[{"description":"Using a 10-minute ritual, the daemogoth can forge a magical bond with a willing creature it touches throughout the ritual. The creature becomes bound by the pact until it dies, the daemogoth dies, or the pact is broken by any effect that can remove a curse.\n\nThe daemogoth chooses one spell from the necromancy or enchantment school that is 3rd level or lower. The bound creature can cast that spell using this pact, requiring no material components and using Intelligence as the spellcasting ability. When it casts the spell, the creature takes 7 (2d6) psychic damage, which can't break the creature's concentration on a spell. Once the bound creature casts the spell in this way, it can't do so again until it finishes a long rest.","id":-1,"monsterId":-1,"name":"Pact of Pain"}],"speed":40,"str":19,"swimSpeed":0,"tag":null,"type":"Fiend","vulnerabilities":null,"wis":14,"xp":5900}