{"ac":12,"actions":[{"description":"The giant makes three Soul Burst attacks. Alternatively, if the giant has its death rune, it can make three Reaping Scythe attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"11 to hit, reach 10 ft. or range 120 ft., one target. Hit: 28 (4d10 + 6) necrotic damage. If the target has the frightened condition, the giant gains temporary hit points equal to the damage dealt.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Soul Burst","type":"NONE"},{"description":"11 to hit, reach 15 ft., one creature. Hit: 38 (7d10) necrotic damage, and the target can't regain hit points until the end of its next turn. The target dies if it is reduced to 0 hit points by this attack.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Reaping Scythe (Requires Death Rune)","type":"NONE"},{"description":"The giant casts one of the following spells, using Intelligence as the spellcasting ability:\nAt will: detect magic, mage armor\n\n3/day each: speak with dead, Tenser's floating disk","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":16,"climbSpeed":0,"con":20,"conditionImmunities":"frightened","cr":"15","damageImmunities":"necrotic","dex":14,"flySpeed":0,"hp":{"constant":85,"diceAmount":17,"diceType":"D12"},"id":-1,"int":23,"isLocked":true,"jsonType":"monster","languages":"Common, Giant","name":"Death Giant Shrouded One [BGG]","resistances":null,"savingThrows":"Con +10, Int +11, Wis +8, Cha +8","senses":"darkvision 120 ft.","size":"Huge","skills":null,"specialTraits":[{"description":"The giant has a death rune inscribed on a giant's skull in its possession. While holding or wearing the skull bearing the rune, the giant can use its Reaping Scythe action and Shroud of Souls bonus action.\n\nThe skull bearing the death rune has AC 18; 35 hit points; and immunity to necrotic, poison, and psychic damage. The skull regains all its hit points at the end of every turn, but it turns to dust if reduced to 0 hit points or when the giant dies. If the rune is destroyed, the giant can inscribe a death rune on another skull in its possession when it finishes a short or long rest.","id":-1,"monsterId":-1,"name":"Death Rune"}],"speed":40,"str":27,"swimSpeed":0,"tag":"wizard","type":"Giant","vulnerabilities":null,"wis":16,"xp":13000}