{"ac":16,"actions":[{"description":"The devourer makes two Claw attacks and can use either Imprison Soul or Soul Rend, if available.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"10 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage plus 21 (6d6) necrotic damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Claw","type":"MELEE"},{"description":"The devourer chooses a living Humanoid with 0 hit points that it can see within 30 feet of it. That creature is teleported inside the devourer's ribcage and imprisoned there. While imprisoned in this way, the creature is restrained and has disadvantage on death saving throws. If the creature dies while imprisoned, the devourer regains 25 hit points and immediately recharges Soul Rend. Additionally, at the start of its next turn, the devourer regurgitates the slain creature as a bonus action, and the creature becomes an undead. If the victim had 2 or fewer Hit Dice, it becomes a zombie. If it had 3 to 5 Hit Dice, it becomes a ghoul. Otherwise, it becomes a wight. A devourer can imprison only one creature at a time.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Imprison Soul","type":"NONE"},{"description":"The devourer creates a vortex of life-draining energy in a 20-foot radius centered on itself. Each creature in that area must make a DC 18 Constitution saving throw, taking 44 (8d10) necrotic damage on a failed save, or half as much damage on a successful one.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Soul Rend (Recharge 6)","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":16,"climbSpeed":0,"con":20,"conditionImmunities":"poisoned","cr":"13","damageImmunities":"poison","dex":12,"flySpeed":0,"hp":{"constant":90,"diceAmount":18,"diceType":"D10"},"id":-1,"int":13,"isLocked":true,"jsonType":"monster","languages":"Abyssal, telepathy 120 ft.","name":"Devourer [MoM]","resistances":"cold, fire, lightning","savingThrows":null,"senses":"darkvision 120 ft.","size":"Large","skills":null,"specialTraits":[{"description":"A devourer doesn't require air, drink, or sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":30,"str":20,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":10,"xp":10000}