{"ac":17,"actions":[{"description":"The shard makes two Telekinetic Rend attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"{@atk ms,rs} 12 to hit, reach 10 ft. or range 120 ft., one target. Hit: 15 (2d8 + 6) force damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Telekinetic Rend","type":"NONE"},{"description":"The shard disappears as it pours its psychic essence into a Medium or smaller nonsentient object it can see within 30 feet of it, magically possessing it. The object uses the shard's AC, and any damage dealt to the object applies to the shard's hit points. The shard inhabits the object until it uses an action to leave; until it is turned; until it is reduced to 0 hit points; or until an effect that ends possession, such as a dispel evil and good spell, is used on it. When it leaves the object, it reappears in the nearest unoccupied space.\n\nWhile inhabited, the object becomes a magic item if it wasn't already, and a Tiny cracked gemstone matching the kind of gem dragon the shard was in life appears somewhere on the object. The shard can cause the object to fly using the shard's own flying speed, use its senses, speak verbally or telepathically, cast spells, and use its legendary actions.\n\nIf a creature wears or carries the inhabited object, the shard can grant the creature the following benefits:\n\nEach of the creature's attacks deals an extra 1d8 force damage on a hit.\n\nThe creature gains resistance to psychic damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Inhabit Object","type":"NONE"},{"description":"The shard unleashes a pulse of psychic power. Each creature of the shard's choice in a 60-foot-radius sphere centered on it must make a DC 20 Intelligence saving throw. On a failed save, the creature takes 55 (10d10) psychic damage and is stunned until the end of its next turn. On a successful save, the creature takes half as much damage and isn't stunned.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Psychic Crush (Recharge 5-6)","type":"NONE"},{"description":"The shard casts one of the following spells, requiring no spell components and using Intelligence as the spellcasting ability (spell save DC 20):\nAt will: detect thoughts, invisibility, telekinesis","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting (Psionics)","type":"NONE"},{"description":"The shard makes one Telekinetic Rend attack.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Rend","type":"NONE"},{"description":"The shard uses Spellcasting.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Cast a Spell (Costs 2 Actions)","type":"NONE"},{"description":"The shard targets a creature it can see within 30 feet of it. The target must succeed on a DC 20 Wisdom saving throw or be charmed until the end of its next turn. While charmed in this way, the target becomes the shard's puppet, acting and moving in accordance with its telepathic commands. While under the shard's control, the target can take only the Attack (shard chooses the target) or Dash action on its turn.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Commanding Thought (Costs 2 Actions)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":22,"climbSpeed":0,"con":18,"conditionImmunities":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone","cr":"17","damageImmunities":"cold, necrotic, poison, psychic","dex":12,"flySpeed":80,"hp":{"constant":64,"diceAmount":16,"diceType":"D12"},"id":-1,"int":22,"isLocked":true,"jsonType":"monster","languages":"Common, Draconic, telepathy 120 ft.","name":"Draconic Shard","resistances":"acid, fire; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Dex +7, Int +12, Wis +10, Cha +12","senses":"blindsight 60 ft., darkvision 120 ft.","size":"Huge","skills":null,"specialTraits":[{"description":"The shard's AC includes its Intelligence modifier.","id":-1,"monsterId":-1,"name":"Deflection"},{"description":"The shard can move through creatures and objects as if they were difficult terrain. If it ends its turn inside an object, it takes 5 (1d10) force damage.","id":-1,"monsterId":-1,"name":"Incorporeal Movement"},{"description":"If the shard fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"},{"description":"When it drops to 0 hit points, the shard disappears and leaves a Tiny cracked gemstone in its space. The gemstone matches the kind of gem dragon it was in life and has AC 20, 15 hit points, and immunity to all damage except force. Unless the gemstone is destroyed, after 1d20 days, the gemstone dissipates and the shard re-forms, regaining all its hit points and appearing in the place the gemstone once occupied or in the nearest unoccupied space.","id":-1,"monsterId":-1,"name":"Rejuvenation"},{"description":"The shard doesn't require air, food, drink, or sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":0,"str":1,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":18,"xp":18000}