{"ac":9,"actions":[{"description":"Each creature within 60 feet of the eidolon that can see it must succeed on a DC 15 Wisdom saving throw or be frightened of it for 1 minute. While frightened in this way, the creature must take the Dash action and move away from the eidolon by the safest available route at the start of each of its turns, unless there is nowhere for it to move, in which case the creature also becomes stunned until it can move again. A frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to any eidolon's Divine Dread for the next 24 hours.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Divine Dread","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":16,"climbSpeed":0,"con":9,"conditionImmunities":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","cr":"12","damageImmunities":"cold, necrotic, poison","dex":8,"flySpeed":40,"hp":{"constant":-18,"diceAmount":18,"diceType":"D8"},"id":-1,"int":14,"isLocked":true,"jsonType":"monster","languages":"the languages it knew in life","name":"Eidolon [MoM]","resistances":"acid, fire, lightning, thunder; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Wis +8","senses":"darkvision 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The eidolon can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object other than a sacred statue|MPMM.","id":-1,"monsterId":-1,"name":"Incorporeal Movement"},{"description":"When the eidolon moves into a space occupied by a sacred statue|MPMM, the eidolon can disappear, causing the statue to become a creature under the eidolon's control. The eidolon uses the sacred statue|MPMM|sacred statue's stat block in place of its own.","id":-1,"monsterId":-1,"name":"Sacred Animation (Recharge 5-6)"},{"description":"The eidolon has advantage on saving throws against any effect that turns Undead.","id":-1,"monsterId":-1,"name":"Turn Resistance"},{"description":"The eidolon doesn't require air, food, drink, or sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":0,"str":7,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":19,"xp":8400}