{"ac":19,"actions":[{"description":"The tempest makes two Thunderous Slam attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"16 to hit, reach 20 ft., one target. Hit: 23 (4d6 + 9) thunder damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Thunderous Slam","type":"MELEE"},{"description":"Each creature within 120 feet of the tempest must make a DC 21 Dexterity saving throw, taking 27 (6d8) lightning damage on a failed save, or half as much damage on a successful one. If a target's saving throw fails by 5 or more, the creature is also stunned until the end of its next turn.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Lightning Storm (Recharge 6)","type":"NONE"},{"description":"The tempest moves up to its speed.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Move","type":"NONE"},{"description":"The tempest can cause a bolt of lightning to strike a point on the ground anywhere under its storm. Each creature within 5 feet of that point must make a DC 21 Dexterity saving throw, taking 16 (3d10) lightning damage on a failed save, or half as much damage on a successful one.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Lightning Strike (Costs 2 Actions)","type":"NONE"},{"description":"The tempest releases a blast of thunder and wind in a line that is 300 feet long and 20 feet wide. Objects in that area take 22 (4d10) thunder damage. Each creature there must succeed on a DC 21 Dexterity saving throw or take 22 (4d10) thunder damage and be flung up to 60 feet in a direction away from the line. If a thrown target collides with an immovable object (such as a wall or floor) or another creature, the target takes 3 (1d6) bludgeoning damage for every 10 feet it was thrown before impact. If the target collides with another creature, that other creature must succeed on a DC 19 Dexterity saving throw or take the same impact damage and be knocked prone.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Screaming Gale (Costs 3 Actions)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":18,"climbSpeed":0,"con":23,"conditionImmunities":"exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned","cr":"23","damageImmunities":"lightning, poison, thunder","dex":28,"flySpeed":120,"hp":{"constant":96,"diceAmount":16,"diceType":"D20"},"id":-1,"int":2,"isLocked":true,"jsonType":"monster","languages":null,"name":"Elder Tempest [MoM]","resistances":"bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Wis +12, Cha +11","senses":"darkvision 60 ft.","size":"Gargantuan","skills":null,"specialTraits":[{"description":"The tempest can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing.","id":-1,"monsterId":-1,"name":"Air Form"},{"description":"The tempest doesn't provoke opportunity attack when it flies out of an enemy's reach.","id":-1,"monsterId":-1,"name":"Flyby"},{"description":"If the tempest fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"},{"description":"The tempest is always at the center of a storm 1d6 + 4 miles in diameter. Heavy precipitation in the form of either rain or snow falls there, causing the area to be lightly obscured. Heavy rain also extinguishes open flames and imposes disadvantage on Wisdom (Perception) checks that rely on hearing. In addition, strong winds swirl in the area covered by the storm. The winds impose disadvantage on ranged attack rolls. They also extinguish open flames and disperse fog.","id":-1,"monsterId":-1,"name":"Living Storm"},{"description":"The tempest deals double damage to objects and structures.","id":-1,"monsterId":-1,"name":"Siege Monster"}],"speed":0,"str":23,"swimSpeed":0,"tag":null,"type":"Elemental","vulnerabilities":null,"wis":21,"xp":50000}