{"ac":14,"actions":[{"description":"The hag makes two Shears attacks. It can replace one attack with a use of Spellcasting.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"6 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) force damage. If the target is a creature, it has disadvantage on attack rolls until the end of the hag's next turn.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Shears","type":"MELEE"},{"description":"While holding its shears, the hag casts one of the following spells, requiring no material components and using Wisdom as the spellcasting ability (spell save DC 14):\nAt will: Bless, Guidance, Silent Image\n\n1/day each: Bane, Bestow Curse, Divination, Scrying (as an action)","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"},{"description":"The hag magically teleports, along with any equipment it is wearing or carrying, to an unoccupied space it can see within 30 feet of itself.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Destined Jaunt","type":"NONE"},{"description":"The hag magically tangles a creature it can see within 60 feet of itself in spectral silver threads. The creature must succeed on a DC 14 Strength saving throw, or its speed is reduced to 0 until the end of its next turn.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Tangle Threads","type":"NONE"},{"description":"The hag magically curses a creature it can see within 60 feet of itself. The creature must make a DC 14 Wisdom saving throw, and the creature has disadvantage on this save if it has damaged the hag within the last minute. On a failed save, the creature has disadvantage on ability checks, attack rolls, and saving throws until the curse ends. Once per turn, when the cursed creature fails one of those d20 rolls, it takes 7 (2d6) force damage. The curse ends after 1 minute; when the creature succeeds on a total of three ability checks, attack rolls, or saving throws in any combination; or when the hag uses this action again.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Destiny Curse (Costs 2 Actions)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":15,"climbSpeed":0,"con":13,"conditionImmunities":"charmed","cr":"4","damageImmunities":null,"dex":14,"flySpeed":0,"hp":{"constant":13,"diceAmount":13,"diceType":"D8"},"id":-1,"int":12,"isLocked":true,"jsonType":"monster","languages":"all","name":"Fate Hag [BMT]","resistances":null,"savingThrows":"Con +3, Wis +6","senses":"truesight 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"If the hag fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (2/Day)"},{"description":"The hag can cast the Legend Lore spell, requiring no material components and using Wisdom as the spellcasting ability.","id":-1,"monsterId":-1,"name":"Trace the Threads (1/Day)"}],"speed":30,"str":12,"swimSpeed":0,"tag":null,"type":"Fey","vulnerabilities":null,"wis":18,"xp":1100}