{"ac":15,"actions":[{"description":"The fensir makes three Battleaxe attacks or two Magic Stone attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage, or 15 (2d10 + 4) slashing damage if used with two hands.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Battleaxe","type":"MELEE"},{"description":"5 to hit, range 60 ft., one target. Hit: 15 (2d12 + 2) bludgeoning damage. If the target is a Large or smaller creature, it must succeed on a DC 13 Strength saving throw or have the prone condition.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Magic Stone","type":"NONE"},{"description":"The fensir lobs a magical mass of mud that splashes all creatures in a 30-foot-radius sphere centered on a point the fensir can see within 60 feet of itself. Each non-fensir creature in that area must succeed on a DC 13 Dexterity saving throw or take 13 (3d8) bludgeoning damage and have the restrained condition as the mud begins to turn to stone. An affected creature must repeat the saving throw at the end of its next turn. On a successful save, the effect ends on the creature. On a failed save, the creature has the petrified condition for 24 hours.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Mud to Stone (Recharge 6)","type":"NONE"},{"description":"The fensir casts one of the following spells, using Intelligence as the spellcasting ability:\n1/day each: create or destroy water, detect magic, pass without trace","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":12,"climbSpeed":0,"con":20,"conditionImmunities":null,"cr":"6","damageImmunities":null,"dex":15,"flySpeed":0,"hp":{"constant":45,"diceAmount":9,"diceType":"D10"},"id":-1,"int":14,"isLocked":true,"jsonType":"monster","languages":"Common, Giant","name":"Fensir Skirmisher [BGG]","resistances":null,"savingThrows":"Int +5, Wis +3","senses":"darkvision 60 ft.","size":"Large","skills":null,"specialTraits":[{"description":"The fensir regains 10 hit points at the start of its turn if it isn't in sunlight. If the fensir takes acid or fire damage, this trait doesn't function at the start of the fensir's next turn. The fensir dies only if it starts its turn with 0 hit points and doesn't regenerate.","id":-1,"monsterId":-1,"name":"Regeneration"},{"description":"When the fensir starts its turn in sunlight, it must succeed on a DC 15 Constitution saving throw or have the petrified condition until the fensir is no longer in sunlight.","id":-1,"monsterId":-1,"name":"Sunlight Hypersensitivity"}],"speed":30,"str":18,"swimSpeed":0,"tag":null,"type":"Giant","vulnerabilities":null,"wis":11,"xp":2300}