{"ac":15,"actions":[{"description":"The fomorian makes three Greatclub attacks. If the fomorian has its blood rune, it can replace one of these attacks with a use of Corrupting Hex.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"10 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage plus 7 (2d6) necrotic damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Greatclub","type":"MELEE"},{"description":"The fomorian targets one creature it can see within 60 feet of itself. The target must succeed on a DC 16 Charisma saving throw or take 27 (6d8) necrotic damage and become cursed for 24 hours. While cursed this way, the target's speed is reduced by half, and if it tries to cast a spell, it must first succeed on a DC 16 Intelligence check or the spell fails and is wasted.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Corrupting Hex (Requires Blood Rune)","type":"NONE"},{"description":"Magical energy explodes in a 20-foot-radius sphere centered on a point the fomorian can see within 120 feet of itself. Each creature in that area must make a DC 16 Dexterity saving throw. On a failed save, a creature takes 32 (5d12) force damage and has the prone condition. On a successful save, a creature takes half as much damage only.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Eldritch Burst","type":"NONE"},{"description":"The fomorian casts one of the following spells, using Charisma as the spellcasting ability (spell save DC 16):\nAt will: detect magic, levitate, mage hand, prestidigitation\n\n1/day each: detect thoughts, suggestion, telekinesis","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":18,"climbSpeed":0,"con":20,"conditionImmunities":null,"cr":"12","damageImmunities":null,"dex":13,"flySpeed":0,"hp":{"constant":90,"diceAmount":18,"diceType":"D12"},"id":-1,"int":9,"isLocked":true,"jsonType":"monster","languages":"Giant, Undercommon","name":"Fomorian Warlock of the Dark [BGG]","resistances":null,"savingThrows":"Wis +6, Cha +8","senses":"darkvision 120 ft.","size":"Huge","skills":null,"specialTraits":[{"description":"The fomorian has a blood rune inscribed on an effigy or some other object in its possession. While holding or wearing the object bearing the rune, the giant can use its Corrupting Hex action and Poisoning Rebuke reaction.\n\nThe object bearing the blood rune has AC 15; 30 hit points; and immunity to necrotic, poison, and psychic damage. The object regains all its hit points at the end of every turn, but it turns to dust if reduced to 0 hit points or when the fomorian dies. If the rune is destroyed, the fomorian can inscribe a blood rune on an object in its possession when it finishes a short or long rest.","id":-1,"monsterId":-1,"name":"Blood Rune"},{"description":"Magical darkness doesn't impede the fomorian's darkvision.","id":-1,"monsterId":-1,"name":"Devil's Sight"},{"description":"If the fomorian fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"}],"speed":30,"str":23,"swimSpeed":0,"tag":null,"type":"Giant","vulnerabilities":null,"wis":14,"xp":8400}