{"ac":13,"actions":[{"description":"5 to hit, reach 5 ft., one target. Hit: 1 piercing damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Bite","type":"MELEE"},{"description":"The gazer shoots two of the following magical eye rays at random (roll two d4s, and reroll duplicates), choosing one or two targets it can see within 60 feet of it:\n\n- 1: Dazing Ray: The targeted creature must succeed on a DC 12 Wisdom saving throw or be charmed until the start of the gazer's next turn. While the target is charmed in this way, its speed is halved, and it has disadvantage on attack rolls.\n- 2: Fear Ray: The targeted creature must succeed on a DC 12 Wisdom saving throw or be frightened until the start of the gazer's next turn.\n- 3: Frost Ray: The target must succeed on a DC 12 Dexterity saving throw or take 10 (3d6) cold damage.\n- 4: Telekinetic Ray: If the target is a creature that is Medium or smaller, it must succeed on a DC 12 Strength saving throw or be moved up to 30 feet directly away from the gazer. If the target is a Tiny object that isn't being worn or carried, the gazer moves it up to 30 feet in any direction. The gazer can also exert fine control on objects with this ray, such as manipulating a simple tool or opening a container.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Eye Rays","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":7,"climbSpeed":0,"con":14,"conditionImmunities":"prone","cr":"1/2","damageImmunities":null,"dex":17,"flySpeed":30,"hp":{"constant":6,"diceAmount":3,"diceType":"D4"},"id":-1,"int":3,"isLocked":true,"jsonType":"monster","languages":null,"name":"Gazer [MoM]","resistances":null,"savingThrows":"Wis +2","senses":"darkvision 60 ft.","size":"Tiny","skills":null,"specialTraits":[{"description":"The gazer can mimic simple sounds of speech it has heard, in any language. A creature that hears the sounds can tell they are imitations with a successful DC 10 Wisdom (Insight) check.","id":-1,"monsterId":-1,"name":"Mimicry"}],"speed":0,"str":3,"swimSpeed":0,"tag":"beholder","type":"Aberration","vulnerabilities":null,"wis":10,"xp":100}