{"ac":18,"actions":[{"description":"The champion makes four Blazing Morningstar attacks. It can replace one of these attacks with Blade Storm, if available.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"12 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) piercing damage plus 14 (4d6) fire damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Blazing Morningstar","type":"MELEE"},{"description":"The champion conjures a churning storm of spectral blades that fills a 20-foot cube centered on a point it can see within 120 feet of itself. The storm lasts until the start of the champion's next turn. While the storm is active, the area of the storm is difficult terrain. Whenever a creature enters the storm for the first time on a turn or starts its turn there, it must make a DC 19 Dexterity saving throw, taking 27 (6d8) slashing damage on a failed saving throw, or half as much damage on a successful one.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Blade Storm (Recharge 5-6)","type":"NONE"},{"description":"The champion moves up to its speed or commands its mount to move up to its speed. This movement doesn't provoke opportunity attacks.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Furious Pursuit","type":"NONE"},{"description":"The champion targets one creature it can see within 60 feet of itself. The target must succeed on a DC 19 Wisdom saving throw or immediately make one melee weapon attack against another creature of the champion's choice that is within the target's reach. If no creature is within the target's reach or if the target has the incapacitated condition, the target instead takes 11 (2d10) psychic damage.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Induce Violence","type":"NONE"},{"description":"The champion chooses any number of creatures it can see within 30 feet of itself. Each target must succeed on a DC 19 Wisdom saving throw or have the frightened condition until the end of its next turn.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Menace (Costs 2 Actions)","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":21,"climbSpeed":0,"con":18,"conditionImmunities":"blinded, charmed, deafened, exhaustion, frightened, poisoned, stunned, unconscious","cr":"20","damageImmunities":"poison","dex":12,"flySpeed":0,"hp":{"constant":132,"diceAmount":33,"diceType":"D8"},"id":-1,"int":10,"isLocked":true,"jsonType":"monster","languages":"Common","name":"Grim Champion of Bloodshed [BMT]","resistances":"cold, necrotic; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Str +12, Dex +7, Con +10","senses":"darkvision 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"If the champion fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"}],"speed":40,"str":23,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":17,"xp":25000}