{"ac":15,"actions":[{"description":"The giant makes one Greatclub attack and uses Stone Bolas.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"9 to hit, reach 10 ft., one target. Hit: 18 (3d8 + 5) bludgeoning damage plus 9 (2d8) thunder damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Greatclub","type":"MELEE"},{"description":"The giant conjures three stone balls connected by lines of magical force and throws them at one creature it can see within 60 feet of itself. The target must make a DC 16 Dexterity saving throw. On a failed save, the target has the restrained condition until the start of the giant's next turn, and the stones erupt in a burst of thunderous energy that deals 14 (4d6) thunder damage to the target and each creature within 10 feet of the target. On a successful save, the stones vanish without erupting.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Stone Bolas","type":"NONE"},{"description":"The giant conjures a hail of rocks in a 20-foot-radius, 40-foot-high cylinder centered on a point on the ground it can see within 120 feet of itself. Each creature in that area must make a DC 16 Dexterity saving throw. On a failed save, a creature takes 28 (8d6) bludgeoning damage and has the prone condition. On a successful save, a creature takes half as much damage only.\n\nThe rocks turn the ground in that area into difficult terrain until the start of the giant's next turn, when the rocks vanish.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Stone Avalanche (Requires Hill Rune)","type":"NONE"},{"description":"The giant casts one of the following spells, using Wisdom as the spellcasting ability (spell save DC 16):\nAt will: druidcraft, guidance\n\n1/day each: stone shape, wall of stone","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":10,"climbSpeed":0,"con":19,"conditionImmunities":null,"cr":"12","damageImmunities":null,"dex":8,"flySpeed":0,"hp":{"constant":84,"diceAmount":21,"diceType":"D12"},"id":-1,"int":9,"isLocked":true,"jsonType":"monster","languages":"Common, Giant","name":"Hill Giant Avalancher [BGG]","resistances":null,"savingThrows":"Str +9, Con +8, Wis +8","senses":null,"size":"Huge","skills":null,"specialTraits":[{"description":"The giant has a hill rune inscribed on a rock or some other object in its possession. While holding or wearing the object bearing the rune, the giant can use its Stone Avalanche action and Hill Rebuff reaction.\n\nThe object bearing the rune has AC 15; 20 hit points; and immunity to necrotic, poison, and psychic damage. The object regains all its hit points at the end of every turn, but it turns to dust if reduced to 0 hit points or when the giant dies. If the rune is destroyed, the giant can inscribe a hill rune on an object in its possession when it finishes a short or long rest.","id":-1,"monsterId":-1,"name":"Hill Rune"},{"description":"If the giant fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"}],"speed":40,"str":21,"swimSpeed":0,"tag":"druid","type":"Giant","vulnerabilities":null,"wis":18,"xp":8400}