{"ac":18,"actions":[{"description":" 3 to hit, reach 5 ft., one target. Hit: 3 (1d6) piercing damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Tusks","type":"MELEE"},{"description":"The hollyphant blows air through its trunk, creating a trumpet sound that can be heard out to a range of 600 feet. The trumpet also creates a 30-foot cone of energy that has one of the following effects, chosen by the hollyphant:","id":-1,"isLegendary":false,"monsterId":-1,"name":"Trumpet (3/Day)","type":"NONE"},{"description":"Each creature in the cone must make a DC 14 Constitution saving throw. On a failed save, a creature takes 17 (5d6) thunder damage and is deafened for 1 minute. On a successful save, a creature takes half as much damage and isn't deafened. Nonmagical objects in the cone that aren't being held or worn take 35 (10d6) thunder damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Trumpet of Blasting","type":"NONE"},{"description":"Creatures in the cone must make a DC 14 Constitution saving throw, taking 22 (4d8 + 4) radiant damage on a failed save, or half as much damage on a successful one. Evil creatures have disadvantage on the saving throw. Good creatures in the cone take no damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Trumpet of Sparkles","type":"NONE"},{"description":"The hollyphant's innate spellcasting ability is Wisdom (spell save DC 15). It can innately cast the following spells, requiring no material components:\nAt will: light\n\n2/day each: bless, cure wounds, protection from evil and good\n\n1/day each: banishment, heal, raise dead, shapechange (into a golden-furred mammoth with feathered wings and a flying speed of 120 ft.), teleport (with no chance of error)","id":-1,"isLegendary":false,"monsterId":-1,"name":"Innate Spellcasting","type":"NONE"}],"alignment":"Lawful Good","burrowSpeed":0,"cha":16,"climbSpeed":0,"con":12,"conditionImmunities":"poisoned","cr":"5","damageImmunities":"poison","dex":11,"flySpeed":120,"hp":{"constant":8,"diceAmount":8,"diceType":"D6"},"id":-1,"int":16,"isLocked":true,"jsonType":"monster","languages":"Celestial, telepathy 120 ft.","name":"Hollyphant","resistances":"bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Dex +3, Con +4, Cha +6","senses":null,"size":"Small","skills":null,"specialTraits":[{"description":"An invisible aura forms a 10-foot-radius sphere around the hollyphant for as long as it lives. Any spell of 5th level or lower cast from outside the barrier can't affect creatures or objects within it, even if the spell is cast using a higher level spell slot. Such a spell can target creatures and objects within the barrier, but the spell has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such spells. The hollyphant can use an action to suppress this trait until its concentration ends (as if concentrating on a spell).","id":-1,"monsterId":-1,"name":"Aura of Invulnerability"},{"description":"The hollyphant's weapon attacks are magical.","id":-1,"monsterId":-1,"name":"Magic Weapons"}],"speed":20,"str":10,"swimSpeed":0,"tag":null,"type":"Celestial","vulnerabilities":null,"wis":19,"xp":1800}