{"ac":15,"actions":[{"description":"The hydroloth makes two Bite or Claw attacks. It can replace one attack with a use of Spellcasting.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"9 to hit, reach 5 ft., one target. Hit: 16 (2d10 + 5) force damage plus 9 (2d10) psychic damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Bite","type":"MELEE"},{"description":"9 to hit, reach 5 ft., one target.  Hit: 14 (2d8 + 5) force damage plus 9 (2d10) psychic damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Claw","type":"MELEE"},{"description":"The hydroloth targets one creature it can see within 60 feet of it. The target takes 14 (4d6) psychic damage, and it must make a DC 16 Intelligence saving throw. On a successful save, the target becomes immune to this hydroloth's Steal Memory for 24 hours. On a failed save, the target loses all proficiencies; it can't cast spells; it can't understand language; and if its Intelligence and Charisma scores are higher than 5, they become 5. Each time the target finishes a long rest, it can repeat the saving throw, ending the effect on itself on a success. A greater restoration or remove curse spell cast on the target ends this effect early.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Steal Memory (1/Day)","type":"NONE"},{"description":"The hydroloth teleports, along with any equipment it is wearing or carrying, up to 60 feet to an unoccupied space it can see.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Teleport","type":"NONE"},{"description":"The hydroloth casts one of the following spells, requiring no material components and using Intelligence as the spellcasting ability (spell save DC 16):\nAt will: darkness, detect magic, dispel magic, invisibility (self only)\n\n3/day each: control water, crown of madness, fear, suggestion","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":14,"climbSpeed":0,"con":16,"conditionImmunities":"poisoned","cr":"9","damageImmunities":"acid, poison","dex":21,"flySpeed":0,"hp":{"constant":54,"diceAmount":18,"diceType":"D8"},"id":-1,"int":19,"isLocked":true,"jsonType":"monster","languages":"Abyssal, Infernal, telepathy 60 ft.","name":"Hydroloth [MoM]","resistances":"cold, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":null,"senses":"blindsight 60 ft., darkvision 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The hydroloth can breathe air and water.","id":-1,"monsterId":-1,"name":"Amphibious"},{"description":"The hydroloth has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"The hydroloth is immune to the waters of the River Styx, as well as any effect that would steal or modify its memories or detect or read its thoughts.","id":-1,"monsterId":-1,"name":"Secure Memory"},{"description":"While submerged in liquid, the hydroloth has advantage on attack rolls.","id":-1,"monsterId":-1,"name":"Watery Advantage"}],"speed":20,"str":12,"swimSpeed":40,"tag":"yugoloth","type":"Fiend","vulnerabilities":"fire","wis":10,"xp":5000}