{"ac":16,"actions":[{"description":"The jiangshi makes three Slam attacks and uses Consume Energy.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":" 8 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Slam","type":"MELEE"},{"description":"The jiangshi draws energy from a creature it can see within 30 feet of it. The target makes a DC 16 Constitution saving throw, taking 18 (4d8) necrotic damage on a failed save, or half as much damage on a successful one. The jiangshi regains hit points equal to the amount of necrotic damage dealt. After regaining hit points from this action, the jiangshi gains the following benefits for 7 days: its walking speed increases to 40 feet, and it gains a flying speed equal to its walking speed and can hover.\n\nA Humanoid slain by this necrotic damage rises as a wight (see its entry in the bestiary) at the end of the jiangshi's turn. The wight acts immediately after the jiangshi in the initiative order. If this wight slays a Humanoid with its Life Drain, the wight transforms into a jiangshi 5 days later.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Consume Energy","type":"NONE"},{"description":"The jiangshi polymorphs into a Beast, a Humanoid, or an Undead that is Medium or Small or back into its true form. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying is absorbed or borne by the new form (the jiangshi's choice). It reverts to its true form if it dies.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Change Shape","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":12,"climbSpeed":0,"con":18,"conditionImmunities":"charmed, exhaustion, frightened, paralyzed, poisoned","cr":"9","damageImmunities":null,"dex":3,"flySpeed":0,"hp":{"constant":56,"diceAmount":14,"diceType":"D8"},"id":-1,"int":17,"isLocked":true,"jsonType":"monster","languages":"any languages it knew in life","name":"Jiangshi","resistances":null,"savingThrows":"Con +8, Int +7, Wis +6, Cha +5","senses":"darkvision 120 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The jiangshi has the following flaws:\n\n- Fear of Its Own Reflection: If the jiangshi sees its own reflection, it immediately uses its reaction, if available, to move as far away from the reflection as possible.\n\n- Susceptible to Holy Symbols: While the jiangshi is wearing or touching a holy symbol, it automatically fails saving throws against effects that turn Undead.","id":-1,"monsterId":-1,"name":"Jiangshi Weaknesses"},{"description":"The jiangshi doesn't require air.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":20,"str":18,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":14,"xp":5000}