{"ac":14,"actions":[{"description":" 5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Fist","type":"MELEE"},{"description":" 5 to hit, range 20/40 ft., one target. Hit: 7 (1d8 + 3) acid damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Acid Squirt","type":"RANGED"},{"description":"The keg robot spews an unnaturally potent beer in a 15-foot cone or in a 30-foot line that is 5 feet wide. Each creature in the area must succeed on a DC 13 Constitution saving throw or be poisoned. While poisoned in this way, a creature has its speed halved by exposure to the potent brew. An affected creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nAdditionally, the beer shower extinguishes any fires or open flames in its area.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Beer Shower","type":"NONE"},{"description":"The keg robot sprays hot oil in a 15-foot cone or in a 30-foot line that is 5 feet wide. Each creature in the area must make a DC 13 Dexterity saving throw. On a failed save, a creature takes 7 (1d8 + 3) fire damage and falls prone. On a successful save, a creature takes half as much damage and doesn't fall prone.\n\nAny creature affected by the hot oil spray that takes fire damage before the oil dries (after 1 minute) takes an additional 3 (1d6) fire damage, and the oil burns away.\n\nIf the oil that remains in the area of the spray is lit, it burns for 1d4 rounds and deals 3 (1d6) fire damage to any creature that enters the area for the first time on a turn or ends its turn there.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Hot Oil Spray (Recharge 5-6)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":5,"climbSpeed":0,"con":15,"conditionImmunities":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","cr":"2","damageImmunities":"poison, psychic","dex":16,"flySpeed":0,"hp":{"constant":12,"diceAmount":6,"diceType":"D8"},"id":-1,"int":6,"isLocked":true,"jsonType":"monster","languages":"understands Common but can't speak","name":"Keg Robot","resistances":"bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":null,"senses":"darkvision 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"A keg robot can hold up to three types of liquid payload totaling 12 gallons within its hollow, barrel-shaped body. A full keg robot can make one liquid attack per gallon before the liquid must be refilled. Filling a keg robot takes 2 rounds per gallon. Differing payloads can alter the keg robot's attacks from those presented here.","id":-1,"monsterId":-1,"name":"Customizable Storage"}],"speed":30,"str":16,"swimSpeed":0,"tag":null,"type":"Construct","vulnerabilities":null,"wis":8,"xp":450}