{"ac":13,"actions":[{"description":"The leprechaun makes two Cobbler's Hammer attacks and can use Spellcasting.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage plus 13 (3d8) force damage. If the target is a creature, its speed is halved until the start of the leprechaun's next turn.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Cobbler's Hammer","type":"MELEE"},{"description":"The leprechaun touches a creature and magically gifts the target a measure of luck. The creature gains the leprechaun's Astonishing Luck reaction. The creature can use the reaction three times, after which this gift goes away. The leprechaun can revoke this gift from a creature at any time (no action required). A creature can benefit from only one leprechaun's Gift of Luck at a time.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Gift of Luck (1/Day)","type":"NONE"},{"description":"The leprechaun casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 14):\nAt will: Mending (as an action), Prestidigitation\n\n2/day each: Invisibility, Phantasmal Force\n\n1/day each: Fabricate (as an action), Mislead","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":18,"climbSpeed":0,"con":16,"conditionImmunities":null,"cr":"4","damageImmunities":null,"dex":17,"flySpeed":0,"hp":{"constant":24,"diceAmount":8,"diceType":"D6"},"id":-1,"int":12,"isLocked":true,"jsonType":"monster","languages":"Common, Sylvan","name":"Leprechaun [QftIS]","resistances":null,"savingThrows":"Con +5, Wis +4","senses":"darkvision 60 ft.","size":"Small","skills":null,"specialTraits":[{"description":"The leprechaun is proficient with all artisan's tools and adds double its proficiency bonus to ability checks made with them.","id":-1,"monsterId":-1,"name":"Industrious"},{"description":"When a creature offers the leprechaun the chance to partake in merriment or revelry such as a song, a dance, or a good meal, the leprechaun must succeed on a DC 15 Wisdom saving throw or have the charmed condition for 24 hours. While charmed in this way, the leprechaun partakes of the offering, treats the creature as a trusted friend, and seeks to defend it from harm. The charmed condition ends if the creature or any of its allies damage the leprechaun, force the leprechaun to make a saving throw, or steal from the leprechaun.","id":-1,"monsterId":-1,"name":"Reluctant Refusal"}],"speed":30,"str":6,"swimSpeed":0,"tag":null,"type":"Fey","vulnerabilities":null,"wis":14,"xp":1100}