{"ac":17,"actions":[{"description":"Malaxxix makes two Forge Hammer or Whip attacks in any combination.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"12 to hit, reach 10 ft. or range 60/180 ft., one target. Hit: 28 (4d10 + 6) bludgeoning damage, and the target can't take reactions until the end of Malaxxix's next turn. Hit or Miss: The hammer then magically returns to Malaxxix's hand.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Forge Hammer","type":"MELEE_OR_RANGED"},{"description":"12 to hit, reach 30 ft., one creature. Hit: 15 (2d8 + 6) slashing damage, and the target has the restrained condition for 1 minute. The restrained target can make a DC 20 Strength saving throw at the end of each of its turns, ending the effect on itself on a success. Only one creature can be restrained by the whip at a time.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Whip","type":"MELEE"},{"description":"Malaxxix summons a vortex of whirling mezzoloths at a point it can see within 90 feet of itself. The vortex is a 30-foot-radius, 100-foot-high cylinder centered on that point. Each creature other than Malaxxix in that area must make a DC 20 Dexterity saving throw. On a failed save, a creature takes 35 (10d6) force damage and has the restrained condition while within the cylinder. On a successful save, a creature takes half as much damage and is pushed to the nearest unoccupied space outside the cylinder. The vortex lasts until the start of Malaxxix's next turn.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Mezzoloth Vortex (Recharge 5-6)","type":"NONE"},{"description":"Malaxxix moves up to its speed. This movement doesn't provoke opportunity attacks. When Malaxxix moves within 5 feet of a creature during this movement, that creature takes 5 (1d10) lightning damage. A creature can take this damage only once per turn.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Fiendish Stride","type":"NONE"},{"description":"Malaxxix makes one Forge Hammer or Whip attack.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Attack (Costs 2 Actions)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":18,"climbSpeed":0,"con":22,"conditionImmunities":"charmed, exhaustion, frightened, poisoned","cr":"18","damageImmunities":"acid, poison","dex":16,"flySpeed":60,"hp":{"constant":150,"diceAmount":25,"diceType":"D12"},"id":-1,"int":22,"isLocked":true,"jsonType":"monster","languages":"Abyssal, Infernal, telepathy 120 ft.","name":"Malaxxix [BMT]","resistances":"cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Str +12, Con +12","senses":"truesight 120 ft.","size":"Huge","skills":null,"specialTraits":[{"description":"If Malaxxix fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"},{"description":"Malaxxix has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"}],"speed":40,"str":23,"swimSpeed":0,"tag":"yugoloth","type":"Fiend","vulnerabilities":null,"wis":20,"xp":20000}