{"ac":22,"actions":[{"description":"+17 to hit, reach 10 ft., one target. Hit: 36 (4d12 + 10) force damage. Or Ranged Weapon Attack: +17 to hit, range 120 ft., one target. Hit: 36 (4d12 + 10) force damage. If the target is an object, it takes triple damage. If the target is an object, it takes triple damage","id":-1,"isLegendary":false,"monsterId":-1,"name":"Destructive Fist","type":"MELEE"},{"description":"If the servant jumps at least 25 feet as part of its movement, it can then use this action to land on its feet in a space that contains one or more other creatures. Each of those creatures is pushed to an unoccupied space within 5 feet of the servant and must make a DC 25 Dexterity saving throw. On a failed save, a creature takes 26 (4d12) bludgeoning damage and is knocked prone. On a successful save, a creature takes half as much damage and isn\u0027t knocked prone","id":-1,"isLegendary":false,"monsterId":-1,"name":"Crushing Leap","type":"NONE"}],"alignment":"Unaligned","burrowSpeed":0,"cha":10,"climbSpeed":0,"con":20,"conditionImmunities":"blinded, charmed, deafened, frightened, grappled, incapacitated, paralyzed, petrified, poisoned, restrained, stunned","cr":"23","damageImmunities":"acid, bludgeoning, cold, fire, lightning, necrotic, poison, psychic, radiant","dex":14,"flySpeed":0,"hp":{"constant":135,"diceAmount":27,"diceType":"D12"},"id":-1,"int":1,"isLocked":false,"jsonType":"monster","languages":"understands the languages of creatures attuned to it but can\u0027t speak","name":"Mighty Servant of Leuk-o","resistances":"piercing, slashing","savingThrows":"Wis +9, Cha +7","senses":"blindsight 120 ft., passive Perception 19","size":"Huge","skills":"Perception +9","specialTraits":[{"description":"The servant is immune to any spell or effect that would alter its form or send it to another plane of existence","id":-1,"monsterId":-1,"name":"Immutable Existence"},{"description":"The servant has advantage on saving throws against spells and other magical effects, and spell attacks made against it have disadvantage","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"The servant regains 10 hit points at the start of its turn. If it is reduced to 0 hit points, this trait doesn\u0027t function until an attuned creature spends 24 hours repairing the artifact or until the artifact is subjected to lightning damage","id":-1,"monsterId":-1,"name":"Regeneration"},{"description":"The servant\u0027s long jump is up to 50 feet and its high jump is up to 25 feet, with or without a running start","id":-1,"monsterId":-1,"name":"Standing Leap"},{"description":"The servant doesn\u0027t require air, food, drink, or sleep","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":60,"str":30,"swimSpeed":0,"tag":"","type":"Construct","wis":14,"xp":50000}