{"ac":15,"actions":[{"description":"The mindwitness makes one Bite attack and one Tentacles attack, or it uses Eye Ray three times.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"5 to hit, reach 5 ft., one target. Hit: 16 (4d6 + 2) piercing damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Bite","type":"MELEE"},{"description":"5 to hit, reach 10 ft., one creature. Hit: 20 (4d8 + 2) psychic damage. If the target is Large or smaller, it is grappled (escape DC 13), and it must succeed on a DC 13 Intelligence saving throw or be restrained until this grapple ends.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Tentacles","type":"MELEE"},{"description":"The mindwitness shoots one magical eye ray at random (roll a d6, and reroll if the ray has already been used this turn), choosing one target it can see within 120 feet of it:\n\n- 1: Aversion Ray: The targeted creature must make a DC 13 Charisma saving throw. On a failed save, the target has disadvantage on attack rolls for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n- 2: Fear Ray: The targeted creature must succeed on a DC 13 Wisdom saving throw or be frightened for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n- 3: Psychic Ray: The target must succeed on a DC 13 Intelligence saving throw or take 27 (6d8) psychic damage.\n- 4: Slowing Ray: The targeted creature must make a DC 13 Dexterity saving throw. On a failed save, the target's speed is halved for 1 minute. In addition, the creature can't take reactions, and it can take either an action or a bonus action on its turn but not both. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n- 5: Stunning Ray: The targeted creature must succeed on a DC 13 Constitution saving throw or be stunned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n- 6: Telekinetic Ray: If the target is a creature, it must make a DC 13 Strength saving throw. On a failed save, the mindwitness moves it up to 30 feet in any direction, and it is restrained by the ray's telekinetic grip until the start of the mindwitness's next turn or until the mindwitness is incapacitated.\n\nIf the target is an object weighing 300 pounds or less that isn't being worn or carried, it is telekinetically moved up to 30 feet in any direction. The mindwitness can also exert fine control on objects with this ray, such as manipulating a simple tool or opening a door or a container.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Eye Ray","type":"NONE"}],"alignment":"Lawful Neutral","burrowSpeed":0,"cha":10,"climbSpeed":0,"con":14,"conditionImmunities":"prone","cr":"5","damageImmunities":null,"dex":14,"flySpeed":20,"hp":{"constant":20,"diceAmount":10,"diceType":"D10"},"id":-1,"int":15,"isLocked":true,"jsonType":"monster","languages":"Deep Speech, Undercommon, telepathy 600 ft.","name":"Mindwitness [MoM]","resistances":null,"savingThrows":"Int +5, Wis +5","senses":"darkvision 120 ft.","size":"Large","skills":null,"specialTraits":[{"description":"When the mindwitness receives a telepathic message, it can telepathically share that message with up to seven other creatures within 600 feet of it that it can see.","id":-1,"monsterId":-1,"name":"Telepathic Hub"}],"speed":0,"str":10,"swimSpeed":0,"tag":null,"type":"Aberration","vulnerabilities":null,"wis":15,"xp":1800}