{"ac":18,"actions":[{"description":"The nabassu makes one Bite attack and one Claw attack, and it uses Soul-Stealing Gaze.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"11 to hit, reach 5 ft., one target. Hit: 38 (5d12 + 6) necrotic damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Bite","type":"MELEE"},{"description":"11 to hit, reach 5 ft., one target. Hit: 28 (4d10 + 6) force damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Claw","type":"MELEE"},{"description":"The nabassu targets one creature it can see within 30 feet of it. If the target isn't a Construct or an Undead, it must succeed on a DC 16 Charisma saving throw or take 13 (2d12) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage dealt, and the nabassu regains hit points equal to half that amount. This reduction lasts until the target finishes a short or long rest. The target dies if its hit point maximum is reduced to 0, and if the target is a Humanoid, it immediately rises as a ghoul under the nabassu's control.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Soul-Stealing Gaze","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":17,"climbSpeed":0,"con":21,"conditionImmunities":"poisoned","cr":"15","damageImmunities":"poison","dex":14,"flySpeed":60,"hp":{"constant":100,"diceAmount":20,"diceType":"D8"},"id":-1,"int":14,"isLocked":true,"jsonType":"monster","languages":"Abyssal, telepathy 120 ft.","name":"Nabassu [MoM]","resistances":"cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Str +11, Dex +7","senses":"darkvision 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The nabassu darkens the area around its body in a 10-foot radius. Nonmagical light can't illuminate this area of dim light.","id":-1,"monsterId":-1,"name":"Demonic Shadows"},{"description":"A nabassu can eat the soul of a creature it has killed within the last hour, provided that creature is neither a Construct nor an Undead. The devouring requires the nabassu to be within 5 feet of the corpse for at least 10 minutes, after which it gains a number of Hit Dice (d8s) equal to half the creature's number of Hit Dice. Roll those dice, and increase the nabassu's hit points by the numbers rolled. For every 4 Hit Dice the nabassu gains in this way, its attacks deal an extra 3 (1d6) damage on a hit. The nabassu retains these benefits for 6 days. A creature devoured by a nabassu can be restored to life only by a wish spell.","id":-1,"monsterId":-1,"name":"Devour Soul"},{"description":"The nabassu has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"}],"speed":40,"str":22,"swimSpeed":0,"tag":"demon","type":"Fiend","vulnerabilities":null,"wis":15,"xp":13000}