{"ac":20,"actions":[{"description":"The narzugon makes three Hellfire Lance attacks. It also uses Infernal Command or Terrifying Command.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"10 to hit, reach 10 ft., one target. Hit: 11 (1d12 + 5) piercing damage plus 16 (3d10) fire damage. If this damage kills a creature with a soul, the soul rises from the River Styx as a lemure in Avernus in 1d4 hours. If the creature isn't revived before then, only a wish spell or killing the lemure and casting true resurrection on the creature's original body can restore it to life. Constructs and devils are immune to this effect.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Hellfire Lance","type":"MELEE"},{"description":"Each ally of the narzugon within 60 feet of it can't be charmed or frightened until the end of the narzugon's next turn.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Infernal Command","type":"NONE"},{"description":"Each creature within 60 feet of the narzugon that isn't a Fiend must succeed on a DC 17 Charisma saving throw or become frightened of the narzugon for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. A creature that makes a successful saving throw is immune to this narzugon's Terrifying Command for 24 hours.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Terrifying Command","type":"NONE"},{"description":"The narzugon, or one creature it touches, regains 100 hit points.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Healing (1/Day)","type":"NONE"}],"alignment":"Lawful Evil","burrowSpeed":0,"cha":19,"climbSpeed":0,"con":17,"conditionImmunities":"charmed, frightened, poisoned","cr":"13","damageImmunities":"fire, poison","dex":10,"flySpeed":0,"hp":{"constant":45,"diceAmount":15,"diceType":"D8"},"id":-1,"int":16,"isLocked":true,"jsonType":"monster","languages":"Common, Infernal, telepathy 120 ft.","name":"Narzugon [MoM]","resistances":"acid, cold; bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","savingThrows":"Dex +5, Con +8, Cha +9","senses":"darkvision 120 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The narzugon wears spurs that are part of infernal tack, which allow it to summon its nightmare companion as an action.","id":-1,"monsterId":-1,"name":"Infernal Tack"},{"description":"The narzugon has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"}],"speed":30,"str":20,"swimSpeed":0,"tag":"devil","type":"Fiend","vulnerabilities":null,"wis":14,"xp":10000}