{"ac":16,"actions":[{"description":"13 to hit, reach 15 ft., one target. Hit: 21 (3d8 + 8) bludgeoning damage plus 11 (2d10) psychic damage. If the target is a Large or smaller creature, it must succeed on a DC 18 Strength saving throw or be swallowed by the neothelid. A swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the neothelid, and it takes 21 (6d6) acid damage at the start of each of the neothelid's turns.\n\nIf the neothelid takes 30 damage or more on a single turn from a creature inside it, the neothelid must succeed on a DC 18 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the neothelid. If the neothelid dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 20 feet of movement, exiting prone.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Tentacles","type":"MELEE"},{"description":"The neothelid exhales acid in a 60- foot cone. Each creature in that area must make a DC 18 Dexterity saving throw, taking 35 (10d6) acid damage on a failed save, or half as much damage on a successful one.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Acid Breath (Recharge 5-6)","type":"NONE"},{"description":"The neothelid casts one of the following spells, requiring no spell components and using Wisdom as the spellcasting ability (spell save DC 16):\nAt will: levitate\n\n1/day each: confusion, feeblemind, telekinesis","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting (Psionics)","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":12,"climbSpeed":0,"con":21,"conditionImmunities":null,"cr":"13","damageImmunities":null,"dex":7,"flySpeed":0,"hp":{"constant":75,"diceAmount":15,"diceType":"D20"},"id":-1,"int":3,"isLocked":true,"jsonType":"monster","languages":null,"name":"Neothelid [MoM]","resistances":null,"savingThrows":"Int +1, Wis +8, Cha +6","senses":"blindsight 120 ft. (blind beyond this radius)","size":"Gargantuan","skills":null,"specialTraits":[{"description":"The neothelid is aware of the presence of creatures within 1 mile of it that have an Intelligence score of 4 or higher. It knows the distance and direction to each creature, as well as each creature's Intelligence score, but can't sense anything else about it. A creature protected by a mind blank spell, a nondetection spell, or similar magic can't be perceived in this manner.","id":-1,"monsterId":-1,"name":"Creature Sense"},{"description":"The neothelid has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"}],"speed":30,"str":27,"swimSpeed":0,"tag":null,"type":"Aberration","vulnerabilities":null,"wis":16,"xp":10000}