{"ac":17,"actions":[{"description":"10 to hit, reach 5 ft., one target. Hit: 11 (2d4 + 6) force damage, and the target must make a DC 17 Constitution saving throw, taking 22 (4d10) poison damage on a failed save, or half as much damage on a successful one. On a failure, the target is poisoned for 1 minute. The poisoned target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Infernal Dagger","type":"MELEE"},{"description":"7 to hit, range 100/400 ft., one target. Hit: 14 (2d10 + 3) force damage. The target also suffers one of the following effects of the orthon's choice; the orthon can't use the same effect two rounds in a row:\n\n- Acid: The target must make a DC 17 Constitution saving throw, taking an additional 17 (5d6) acid damage on a failed save, or half as much damage on a successful one.\n- Blindness: The target takes 5 (1d10) radiant damage. In addition, the target and all other creatures within 20 feet of it must each make a successful DC 17 Dexterity saving throw or be blinded until the end of the orthon's next turn.\n- Concussion: The target and each creature within 20 feet of it must make a DC 17 Constitution saving throw, taking 13 (2d12) thunder damage on a failed save, or half as much damage on a successful one.\n- Entanglement: The target must make a successful DC 17 Dexterity saving throw or be restrained for 1 hour by strands of sticky webbing. The target can escape by taking an action to make a DC DC 17 Strength or Dexterity check and succeeding.\n- Paralysis: The target takes 22 (4d10) lightning damage and must make a successful DC 17 Constitution saving throw or be paralyzed for 1 minute. The paralyzed target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n- Tracking: For the next 24 hours, the orthon knows the direction and distance to the target, as long as it's on the same plane of existence. If the target is on a different plane, the orthon knows which one, but not the exact location there.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Brass Crossbow","type":"RANGED"}],"alignment":"Lawful Evil","burrowSpeed":0,"cha":16,"climbSpeed":30,"con":21,"conditionImmunities":"charmed, exhaustion, poisoned","cr":"10","damageImmunities":"fire, poison","dex":16,"flySpeed":0,"hp":{"constant":50,"diceAmount":10,"diceType":"D10"},"id":-1,"int":15,"isLocked":true,"jsonType":"monster","languages":"Common, Infernal, telepathy 120 ft.","name":"Orthon [MoM]","resistances":"cold; bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","savingThrows":"Dex +7, Con +9, Wis +6","senses":"darkvision 120 ft., truesight 30 ft.","size":"Large","skills":null,"specialTraits":[{"description":"The orthon has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"}],"speed":30,"str":22,"swimSpeed":0,"tag":"devil","type":"Fiend","vulnerabilities":null,"wis":15,"xp":5900}