{"ac":18,"actions":[{"description":"The scion makes one Great Tree Club attack and two Slam attacks, or it makes three Boulder attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"15 to hit, reach 30 ft., one target. Hit: 30 (4d10 + 8) bludgeoning damage. If the target is a creature, it must succeed on a DC 23 Strength saving throw or be pushed horizontally up to 100 feet straight away from the scion and have the prone condition.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Great Tree Club","type":"MELEE"},{"description":"15 to hit, reach 20 ft., one target. Hit: 26 (4d8 + 8) force damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Slam","type":"MELEE"},{"description":"15 to hit, range 120/480 ft., one target. Hit: 27 (3d12 + 8) bludgeoning damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Boulder","type":"RANGED"},{"description":"The scion inhales a vortex of air in a 120-foot line that is 15 feet wide. Each creature in that area that is Huge or smaller must succeed on a DC 23 Strength saving throw or be pulled up to 120 feet straight toward the scion and be swallowed. A swallowed creature has the restrained condition, has total cover against attacks and other effects outside the scion, and takes 24 (7d6) force damage at the start of each of the scion's turns.\n\nThe scion's stomach can hold up to two creatures at a time. If the scion takes 60 damage or more on a single turn from a creature inside it, the scion must succeed on a DC 17 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, each of which falls in a space within 10 feet of the scion and has the prone condition. If the scion dies, any swallowed creature no longer has the restrained condition and can escape from the corpse using 15 feet of movement, exiting with the prone condition.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Inhale (Recharge 5-6)","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":18,"climbSpeed":0,"con":25,"conditionImmunities":"exhaustion, paralyzed, poisoned","cr":"22","damageImmunities":"poison","dex":14,"flySpeed":0,"hp":{"constant":161,"diceAmount":23,"diceType":"D20"},"id":-1,"int":15,"isLocked":true,"jsonType":"monster","languages":"Giant, Primordial","name":"Scion of Grolantor [BGG]","resistances":"cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Wis +12, Cha +11","senses":null,"size":"Gargantuan","skills":null,"specialTraits":[{"description":"If the scion fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (6/Day)"},{"description":"The scion has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"The scion deals double damage to objects and structures.","id":-1,"monsterId":-1,"name":"Siege Monster"}],"speed":60,"str":27,"swimSpeed":0,"tag":"titan","type":"Giant","vulnerabilities":null,"wis":21,"xp":41000}