{"ac":14,"actions":[{"description":"5 to hit, reach 5 ft., one target. Hit: 8 (1d10 + 3) bludgeoning damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Slam","type":"MELEE"},{"description":"One Large or smaller creature that the slithering tracker can see within 5 feet of it must succeed on a DC 13 Dexterity saving throw or be grappled (escape DC 13). Until this grapple ends, the target is restrained and unable to breathe unless it can breathe water. In addition, the grappled target takes 16 (3d10) necrotic damage at the start of each of its turns. The slithering tracker can grapple only one target at a time.\n\nWhile grappling the target, the slithering tracker takes only half any damage dealt to it (rounded down), and the target takes the other half.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Life Leech","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":11,"climbSpeed":30,"con":15,"conditionImmunities":"blinded, deafened, exhaustion, grappled, paralyzed, petrified, prone, restrained, unconscious","cr":"3","damageImmunities":null,"dex":19,"flySpeed":0,"hp":{"constant":12,"diceAmount":6,"diceType":"D8"},"id":-1,"int":10,"isLocked":true,"jsonType":"monster","languages":"understands languages it knew in its previous form but can't speak","name":"Slithering Tracker [MoM]","resistances":"bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":null,"senses":"blindsight 120 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"If the slithering tracker is motionless at the start of combat, it has advantage on its initiative roll. Moreover, if a creature hasn't observed the slithering tracker move or act, that creature must succeed on a DC 18 Intelligence (Investigation) check to discern that the slithering tracker isn't a puddle.","id":-1,"monsterId":-1,"name":"False Appearance"},{"description":"The slithering tracker can enter an enemy's space and stop there. It can also move through a space as narrow as 1 inch wide without squeezing.","id":-1,"monsterId":-1,"name":"Liquid Form"},{"description":"The slithering tracker can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.","id":-1,"monsterId":-1,"name":"Spider Climb"}],"speed":30,"str":16,"swimSpeed":30,"tag":null,"type":"Ooze","vulnerabilities":"cold, fire","wis":14,"xp":700}