{"ac":11,"actions":[{"description":"The spectral cloud makes two Spectral Touch attacks.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"12 to hit, reach 10 ft., one target. Hit: 20 (3d8 + 7) force damage plus 10 (3d6) necrotic damage. If the target is a creature, it must succeed on a DC 20 Constitution saving throw, or its hit point maximum is reduced by an amount equal to the necrotic damage taken. This reduction lasts until the target finishes a long rest. The target dies if its hit point maximum is reduced to 0.\n\nA Humanoid slain by this attack immediately rises as a miniature spectral cloud (use the specter stat block in the bestiary). The miniature spectral cloud acts as an ally of its creator but isn't under its control.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spectral Touch","type":"MELEE"},{"description":"The spectral cloud emits intensely cold wind in a 60-foot line that is 10 feet wide. Each creature in that area must make a DC 20 Constitution saving throw. On a failed save, a creature takes 38 (7d10) cold damage and has the incapacitated condition for 1 minute. The affected creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. On a successful save, a creature takes half as much damage only.\n\nIf a creature's saving throw is successful or the effect ends for it, that creature is immune to this spectral cloud's Chilling Winds for the next 24 hours.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Chilling Winds (Recharge 5-6)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":16,"climbSpeed":0,"con":18,"conditionImmunities":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","cr":"13","damageImmunities":"poison, thunder","dex":12,"flySpeed":40,"hp":{"constant":72,"diceAmount":18,"diceType":"D12"},"id":-1,"int":12,"isLocked":true,"jsonType":"monster","languages":"Common, Giant","name":"Spectral Cloud [BGG]","resistances":"cold, necrotic; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Dex +6, Cha +8","senses":null,"size":"Huge","skills":null,"specialTraits":[{"description":"Attack rolls against the spectral cloud are made with disadvantage unless the attacker is within 15 feet of the spectral cloud or the spectral cloud is incapacitated.","id":-1,"monsterId":-1,"name":"Blurred Form"},{"description":"The spectral cloud can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.","id":-1,"monsterId":-1,"name":"Incorporeal Movement"}],"speed":0,"str":24,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":17,"xp":10000}