{"ac":10,"actions":[{"description":"6 to hit, reach 5 ft. or range 120 ft., one target. Hit: 20 (5d6 + 3) radiant damage, and if the target is a creature, it must succeed on a DC 14 Wisdom saving throw or be blinded for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Radiant Eruption","type":"NONE"},{"description":"One Humanoid that the apparition can see within 5 feet of itself must succeed on a DC 14 Charisma saving throw or be possessed by the apparition; the apparition then disappears, and the target is incapacitated and loses control of its body. The apparition now controls the body but doesn't deprive the target of awareness. The apparition can't be targeted by any attack, spell, or other effect, and it retains its alignment, Intelligence, Wisdom, Charisma, and immunity to being charmed and frightened. It otherwise uses the possessed target's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies.\n\nThe possession lasts until the body drops to 0 hit points, the apparition ends it as a bonus action, the body leaves the Astral Plane, or the apparition is forced out by an effect like the dispel evil and good spell. When the possession ends, the apparition reappears in an unoccupied space within 5 feet of the body. If it reappears in a location not on the Astral Plane, the apparition is destroyed. The target is immune to this apparition's Possession for 24 hours after succeeding on the saving throw or after the possession ends.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Possession (Recharge 6)","type":"NONE"}],"alignment":"True Neutral","burrowSpeed":0,"cha":16,"climbSpeed":0,"con":10,"conditionImmunities":"blinded, charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","cr":"5","damageImmunities":"poison, radiant","dex":11,"flySpeed":30,"hp":{"constant":null,"diceAmount":16,"diceType":"D8"},"id":-1,"int":18,"isLocked":true,"jsonType":"monster","languages":"the languages it knew in life","name":"Starlight Apparition [BAM]","resistances":"acid, cold, fire; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":null,"senses":"darkvision 120 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The apparition can exist only on the Astral Plane. If it is sent to a location not on the Astral Plane, the apparition is destroyed.","id":-1,"monsterId":-1,"name":"Astral Existence"},{"description":"While it has at least 1 hit point, the apparition sheds bright light in a 20-foot radius and dim light for an additional 20 feet.","id":-1,"monsterId":-1,"name":"Illumination"},{"description":"The apparition can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.","id":-1,"monsterId":-1,"name":"Incorporeal Movement"},{"description":"The apparition doesn't require air, drink, food, or sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":0,"str":1,"swimSpeed":0,"tag":null,"type":"Celestial","vulnerabilities":null,"wis":16,"xp":1800}