{"ac":20,"actions":[{"description":"Titivilus makes one Silver Sword attack, and he uses Frightful Word.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"9 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) force damage, or 9 (1d10 + 4) force damage if used with two hands, plus 16 (3d10) necrotic damage. If the target is a creature, its hit point maximum is reduced by an amount equal to half the necrotic damage taken.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Silver Sword","type":"MELEE"},{"description":"Titivilus targets one creature he can see within 10 feet of him. The target must succeed on a DC 21 Wisdom saving throw or become frightened of him for 1 minute. While frightened in this way, the target must take the Dash action and move away from Titivilus by the safest available route on each of its turns, unless there is nowhere to move, in which case it needn't take the Dash action. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Frightful Word","type":"NONE"},{"description":"Titivilus teleports, along with any equipment he is wearing or carrying, up to 120 feet to an unoccupied space he can see.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Teleport","type":"NONE"},{"description":"Titivilus targets one creature he can see within 60 feet of him. The target must succeed on a DC 21 Charisma saving throw or become charmed by Titivilus for 1 minute. The charmed target can repeat the saving throw if Titivilus deals any damage to it. A creature that succeeds on the saving throw is immune to Titivilus's Twisting Words for 24 hours.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Twisting Words","type":"NONE"},{"description":"Titivilus casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 21):\nAt will: alter self, major image, nondetection, sending, suggestion\n\n3/day each: mislead, modify memory","id":-1,"isLegendary":false,"monsterId":-1,"name":"Spellcasting","type":"NONE"},{"description":"Titivilus uses Twisting Words. Alternatively, he targets one creature charmed by him that is within 60 feet of him; that charmed target must succeed on a DC 21 Charisma saving throw, or Titivilus decides how the target acts during its next turn.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Corrupting Guidance","type":"NONE"},{"description":"Titivilus uses Teleport.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Teleport","type":"NONE"},{"description":"Titivilus makes one Silver Sword attack, or he uses Frightful Word.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Assault (Costs 2 Actions)","type":"NONE"}],"alignment":"Lawful Evil","burrowSpeed":0,"cha":26,"climbSpeed":0,"con":17,"conditionImmunities":"charmed, exhaustion, frightened, poisoned","cr":"16","damageImmunities":"fire, poison","dex":22,"flySpeed":60,"hp":{"constant":60,"diceAmount":20,"diceType":"D8"},"id":-1,"int":24,"isLocked":true,"jsonType":"monster","languages":"all, telepathy 120 ft.","name":"Titivilus [MoM]","resistances":"cold; bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","savingThrows":"Dex +11, Con +8, Wis +11, Cha +13","senses":"darkvision 120 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"If Titivilus fails a saving throw, he can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"},{"description":"Titivilus has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"},{"description":"Titivilus regains 10 hit points at the start of his turn. If he takes cold or radiant damage, this trait doesn't function at the start of his next turn. Titivilus dies only if he starts his turn with 0 hit points and doesn't regenerate.","id":-1,"monsterId":-1,"name":"Regeneration"},{"description":"Whenever Titivilus speaks, he can choose a point within 60 feet of him; his voice emanates from that point.","id":-1,"monsterId":-1,"name":"Ventriloquism"}],"speed":40,"str":19,"swimSpeed":0,"tag":"devil","type":"Fiend","vulnerabilities":null,"wis":22,"xp":15000}