{"ac":13,"actions":[{"description":"The mist touches one creature in its space. The target must succeed on a DC 13 Constitution saving throw (Undead and Constructs automatically succeed), or it takes 10 (2d6 + 3) necrotic damage, the mist regains 10 hit points, and the target's hit point maximum is reduced by an amount equal to the necrotic damage taken. This reduction lasts until the target finishes a long rest. The target dies if its hit point maximum is reduced to 0.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Life Drain","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":7,"climbSpeed":0,"con":16,"conditionImmunities":"charmed, exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained","cr":"3","damageImmunities":"poison","dex":16,"flySpeed":30,"hp":{"constant":12,"diceAmount":4,"diceType":"D8"},"id":-1,"int":6,"isLocked":true,"jsonType":"monster","languages":null,"name":"Vampiric Mist [MoM]","resistances":"acid, cold, lightning, necrotic, thunder; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Wis +3","senses":"darkvision 60 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The mist can sense the location of any creature within 60 feet of it, unless that creature's type is Construct or Undead.","id":-1,"monsterId":-1,"name":"Life Sense"},{"description":"The mist can't enter a residence without an invitation from one of the occupants.","id":-1,"monsterId":-1,"name":"Forbiddance"},{"description":"The mist can occupy another creature's space and vice versa. In addition, if air can pass through a space, the mist can pass through it without squeezing. Each foot of movement in water costs it 2 extra feet, rather than 1 extra foot. The mist can't manipulate objects in any way that requires fingers or manual dexterity.","id":-1,"monsterId":-1,"name":"Misty Form"},{"description":"The mist takes 10 radiant damage whenever it starts its turn in sunlight. While in sunlight, the mist has disadvantage on attack rolls and ability checks.","id":-1,"monsterId":-1,"name":"Sunlight Hypersensitivity"},{"description":"The mist doesn't require air or sleep.","id":-1,"monsterId":-1,"name":"Unusual Nature"}],"speed":0,"str":6,"swimSpeed":0,"tag":null,"type":"Undead","vulnerabilities":null,"wis":12,"xp":700}