{"ac":20,"actions":[{"description":"The veiled presence makes two Blade of Judgment attacks and can use Revelation.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"14 to hit, reach 5 ft. or range 60 ft., one target. Hit: 10 (1d6 + 7) piercing damage plus 27 (6d8) radiant damage. If the target is a creature, it must succeed on a DC 22 Charisma saving throw, or on its next turn, it can either move or take an action, but not both.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Blade of Judgment","type":"MELEE_OR_RANGED"},{"description":"The veiled presence reveals a glimpse of its otherworldly nature to a creature it can see within 30 feet of itself. The target must succeed on a DC 22 Wisdom saving throw or have the paralyzed condition until the end of its next turn, after which the target is immune to this Revelation for 24 hours.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Revelation","type":"NONE"},{"description":"The veiled presence magically teleports, along with any equipment it is wearing or carrying, up to 40 feet to an unoccupied space that it can see.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Flash Step","type":"NONE"},{"description":"The veiled presence makes one Blade of Judgment attack.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Stab (Costs 2 Actions)","type":"NONE"},{"description":"The veiled presence magically emanates dazzling light in a 10-foot-radius sphere centered on itself until the end of its next turn, during which time attack rolls against it have disadvantage and it has advantage on attack rolls. The sphere moves with the veiled presence. When another creature starts its turn in the light or enters the light for the first time on its turn, that creature must make a DC 22 Constitution saving throw, taking 18 (4d8) radiant damage on a failed save, or half as much damage on a successful one.","id":-1,"isLegendary":true,"monsterId":-1,"name":"Searing Radiance (Costs 3 Actions)","type":"NONE"}],"alignment":"Lawful Evil","burrowSpeed":0,"cha":22,"climbSpeed":0,"con":16,"conditionImmunities":"charmed, frightened","cr":"21","damageImmunities":null,"dex":24,"flySpeed":80,"hp":{"constant":120,"diceAmount":40,"diceType":"D8"},"id":-1,"int":24,"isLocked":true,"jsonType":"monster","languages":"all","name":"Veiled Presence [BMT]","resistances":"necrotic, radiant","savingThrows":"Dex +14, Int +14","senses":"truesight 30 ft.","size":"Medium","skills":null,"specialTraits":[{"description":"The veiled presence can't be targeted by divination magic or by features that would read its mind or determine its creature type.","id":-1,"monsterId":-1,"name":"Inviolate Presence"},{"description":"If the veiled presence fails a saving throw, it can choose to succeed instead.","id":-1,"monsterId":-1,"name":"Legendary Resistance (3/Day)"}],"speed":40,"str":14,"swimSpeed":0,"tag":null,"type":"Celestial","vulnerabilities":null,"wis":20,"xp":33000}