{"ac":18,"actions":[{"description":"The wastrilith makes one Bite attack and two Claw attacks, and it uses Grasping Spout.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Multiattack","type":"NONE"},{"description":"9 to hit, reach 10 ft., one target. Hit: 30 (4d12 + 4) piercing damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Bite","type":"MELEE"},{"description":"9 to hit, reach 10 ft., one target. Hit: 18 (4d6 + 4) slashing damage.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Claws","type":"MELEE"},{"description":"The wastrilith magically launches a spout of water at one creature it can see within 60 feet of it. The target must make a DC 17 Strength saving throw, and it has disadvantage if it's underwater. On a failed save, it takes 22 (4d8 + 4) acid damage and is pulled up to 60 feet toward the wastrilith. On a successful save, it takes half as much damage and isn't pulled.","id":-1,"isLegendary":false,"monsterId":-1,"name":"Grasping Spout","type":"NONE"}],"alignment":"Chaotic Evil","burrowSpeed":0,"cha":14,"climbSpeed":0,"con":21,"conditionImmunities":"poisoned","cr":"13","damageImmunities":"poison","dex":18,"flySpeed":0,"hp":{"constant":75,"diceAmount":15,"diceType":"D10"},"id":-1,"int":19,"isLocked":true,"jsonType":"monster","languages":"Abyssal, telepathy 120 ft.","name":"Wastrilith [MoM]","resistances":"cold, fire, lightning; bludgeoning, piercing, slashing from nonmagical attacks","savingThrows":"Str +9, Con +10","senses":"darkvision 120 ft.","size":"Large","skills":null,"specialTraits":[{"description":"The wastrilith can breathe air and water.","id":-1,"monsterId":-1,"name":"Amphibious"},{"description":"At the start of each of the wastrilith's turns, exposed water within 30 feet of it is befouled. Underwater, this effect lightly obscures the area until a current clears it away. Water in containers remains corrupted until it evaporates.\n\nA creature that consumes this foul water or swims in it must make a DC 18 Constitution saving throw. On a successful save, the creature is immune to the foul water for 24 hours. On a failed save, the creature takes 14 (4d6) poison damage and is poisoned for 1 minute. At the end of this time, the poisoned creature must repeat the saving throw. On a failure, the creature takes 18 (4d8) poison damage and is poisoned until it finishes a long rest.\n\nIf another demon drinks the foul water as an action, it gains 11 (2d10) temporary hit points.","id":-1,"monsterId":-1,"name":"Corrupt Water"},{"description":"The wastrilith has advantage on saving throws against spells and other magical effects.","id":-1,"monsterId":-1,"name":"Magic Resistance"}],"speed":30,"str":19,"swimSpeed":80,"tag":"demon","type":"Fiend","vulnerabilities":null,"wis":12,"xp":10000}